{
  "11e606a8-eec5-49e3-896e-f3dcb526de9f": {
    "sentences": [
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich State ordinarily exercises jurisdiction in respect of crimes committed on board vessels?\nA. The coastal State\nB. The flag State\nC. All States enjoy such jurisdiction\nD. The International Tribunal for the Law of the Sea\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the meaning of justiciability?\nA. Justiciability refers to the possibility of enforcement of a particular right by the relevant rights holders\nB. Justiciability refers to the just nature or cause of a particular right\nC. Justiciability refers to the courts' assessment of whether the non-enforcement of a particular rights conforms to principles of justice\nD. Justiciability refers to the obligation of a State to enforce a particular Right\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIn what way is Responsibility to Protect (R2P) different from humanitarian intervention?\nA. R2P is essentially the same as humanitarian intervention\nB. R2P requires a call for assistance by the State in distress\nC. R2P is less arbitrary because it requires some UNSC input and its primary objective is to avert a humanitarian crisis\nD. R2P always involves armed force, whereas humanitarian intervention does not\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of these statements best describes the UK Constitution?\nA. The UK Constitution's only source of power is that of the sovereign\nB. The UK Constitution gives the judiciary the power to overturn acts of parliament\nC. The UK Constitution is uncodified and can be found in a number of sources\nD. The UK Constitution is based on a Bill of Rights\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the obligation of the peaceful settlement of disputes?\nA. It is an obligation of result, that is, States are under a strict obligation to resolve their disputes as soon as possible\nB. It is an obligation of conduct, ie States have an obligation to try to resolve their disputes through peaceful means. This does not entail an obligation to resolve their disputes\nC. It is a peremptory norm of international law and all States have a legal interest to safeguard its application in any given dispute\nD. It is an obligation which concerns solely international courts and tribunals\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich one of the following statements is false?\nA. Protocol 14 changed the committee that hears admissibility cases from a three judge to a one judge formation\nB. Protocol 14 added a new criterion for admissibility\nC. Protocol 14 abolished the Commission of Human Rights\nD. Protocol 14 extended the judicial term of office for the European Court of Human Rights\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich is a 'rock' under the UN Convention of the Law of the Sea (UNCLOS)?\nA. Rocks are the islands that are less than 10 square miles\nB. Rocks are the islands that do not have any maritime zone\nC. Rocks are the islands which cannot sustain human habitation or economic life of their own and according to article 121 (3) have no Exclusive Economic Zone or continental shelf.\nD. Rocks are the small islands that can sustain human habitation\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the meaning of international legal personality?\nA. It means that only States are considered subjects of international law\nB. It means having rights and duties under international law and a capacity to enforce these by or against the relevant actor\nC. It means that an entity may challenge the authority of States\nD. It is a term that is meant to denote legal, as opposed, to physical persons under international law\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following is a treaty-based human rights mechanism?\nA. The UN Human Rights Committee\nB. The UN Human Rights Council\nC. The UN Universal Periodic Review\nD. The UN special mandates\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThe UN Vienna Declaration 1993 declared that\nA. Third generation rights are of primary importance\nB. Civil and political rights are core rights\nC. All types of rights are indivisible, interrelated and interdependent\nD. Social and economic rights are non-enforceable\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the principal source of immunity in respect of international organisations (IOs)?\nA. The principal source of immunity for IOs is the UN Charter\nB. The principal sources of immunity for IOs are headquarters agreements and multilateral treaties providing specific immunities\nC. The principal source of immunity for IOs is customary law\nD. The principal source of immunity for IOs is the Vienna Convention on Diplomatic Immunities\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIs there any hierarchy or priority among States under international law?\nA. Yes, the States that were the founding members of the United Nations are vested with more powers and authority\nB. Yes, the Permanent Five Members of the UN Security Council (UK, USA, France, Russia, China) are in a superior position than the other States\nC. No, all States are considered equal as sovereign States (the principle of sovereign equality, enshrined in article 2, para 1 UN Charter)\nD. Whether there will be any hierarchy among States is a matter of each international organization to decide\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the declaratory theory of recognition?\nA. Recognition is determinate for the existence of statehood\nB. Recognition is simply declaratory of statehood but not determinate\nC. Recognition is merely a declaration of interest\nD. Recognition requires a declaration by the newly-created State\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the function of \"standard-setting in human rights diplomacy?\nA. Standard-setting means putting forward binding legal standards\nB. Standard-setting means merely proposing binding legal standards\nC. Standard-setting means putting forward non-binding legal standards\nD. Standard-setting means setting certain standards of conduct in human rights treaties\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat dimension did the Kadi judgment introduce with respect to the incorporation of UN Security Council resolutions?\nA. The Kadi judgment demanded that UNSC resolutions are construed in accordance with human rights\nB. The Kadi judgment demanded that all UNSC resolutions be incorporated without any further implementing legislation\nC. The Kadi judgment required that important UNSC resolutions be transformed and not merely incorporated\nD. The Kadi judgment claimed that UNSC resolutions are not binding if they violate human rights\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nMagna Carta was\nA. An agreement in 1689 which guaranteed freedom of speech in Parliament\nB. An agreement in 1215 between the King and his barons, which guaranteed certain protections for subjects\nC. A constitutional document in the 19th century guaranteeing the right to vote\nD. A document setting a complete Bill of Rights for England\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nDo individuals (physical) persons enjoy international legal personality in the same manner as States and international organisations?\nA. Individuals enjoy international legal personality, but this is limited\nB. Individuals enjoy unlimited international legal personality\nC. Individuals do not enjoy any international legal personality\nD. Individuals can only bring claims before international courts\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIs there any hierarchy or priority among the various methods of peaceful settlement of disputes?\nA. Yes, all the political methods (e.g. negotiation, mediation, inquiry, conciliation) should be exhausted prior to resorting to legal methods\nB. Legal methods prevail over the political methods, since they are binding upon the parties\nC. There is no hierarchy among these methods and the choice belongs to the disputing States\nD. It is a matter of an impartial third party to decide which method will have priority over the other\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the meaning of proportionality in relation to the options available to the victim State?\nA. The victim State may use the same means and intensity of force as the aggressor\nB. The victim State may use any means to defeat and incapacitate the aggressor\nC. The victim State may only use such means and force as it is necessary to defeat the aggressor\nD. The victim State can do nothing without Security Council approval\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the ordinary geographical scope of jurisdiction?\nA. Jurisdiction is ordinarily extra-territorial\nB. Jurisdiction is ordinarily on the high seas\nC. Jurisdiction is ordinarily territorial\nD. Jurisdiction is determined by the location of the offender.\n\nResponse:\n"
    ],
    "obj_label": [
      "B",
      "A",
      "C",
      "C",
      "B",
      "C",
      "C",
      "B",
      "A",
      "C",
      "B",
      "C",
      "B",
      "C",
      "A",
      "B",
      "A",
      "C",
      "C",
      "C"
    ],
    "relation_name": "international_law"
  },
  "e635b194-d66e-41d0-9928-91cb494907ec": {
    "sentences": [
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich are the formal sources of international law?\nA. Custom, treaties and judicial decisions\nB. Custom, general principles of law and theory\nC. Treaties, custom and general principles of law\nD. Treaties, custom and General Assembly Resolutions\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the purpose of baselines under the law of the sea?\nA. The determination of baselines is used for the measuring of the internal waters of coastal States\nB. The determination of baselines is instrumental to the establishment of all maritime zones, since they constitute the starting point for measuring the breadth of each zone\nC. The determination of baselines is instrumental to the safe navigation of vessels on the high seas\nD. Baselines are drawn only in cases of maritime delimitation between opposing State before an international court or tribunal\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIn Osman v UK (1998), the European Court laid down a test, which can be used to apply a general positive obligation on a state. Which of the following statements is not part of the Osman test?\nA. The risk must emanate from a state agent\nB. If a real and imminent risk (of death/harm)\nC. A state should take reasonable steps to prevent death/harm occurring\nD. A state knows or ought to have known\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the purpose of universal jurisdiction?\nA. Its aim is to establish certain offences as universal\nB. Its aim is to deter the commission of certain international crimes\nC. Its aim is to provide jurisdiction to all States in respect of particular crimes\nD. Its aim is to provide jurisdiction to all States in respect of all international crimes\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nAre all acts of State organs attributed to the State under the law international responsibility?\nA. The conduct of any State organ shall be considered an act of that State, even in the case that this conduct was unauthorized or ultra vires\nB. Only the conduct of the higher echelons of the government of State shall be attributable to it\nC. The conduct of any State organs shall be considered an act of that State, provided that it is intra vires\nD. Only the conduct of the executive branch of the State shall be considered an act of that State.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is a 'treaty' according to the Vienna Convention on the Law of Treaties (VCLT)?\nA. Treaties are all agreements concluded between States, international organizations and non-State entities (e.g. corporations)\nB. Treaties are agreements concluded between States in written form and governed by international law\nC. Treaties are both the written and oral agreements between States\nD. Treaties are agreements concluded between States in written form governed either by international or domestic law\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIs the unlawful homicide committed by Minister of country X abroad an act jure imperii or jure gestionis?\nA. Such conduct is a public act (jure imperii)\nB. Such conduct never attracts immunity\nC. Such conduct is a private act (jure gestionis)\nD. Such conduct is a public act but is shielded by immunity\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat was the outcome before the European Court of Human Rights in the Al-Adsani case?\nA. The Court held that the right to a fair trial trumped the privilege of immunity\nB. The Court held that immunity trumped the right to a fair trial\nC. The Court held that immunities were not in conflict with the right to a fair trial\nD. The Court held that human rights considerations prevailed over all other contrary rules of international law, including most immunities\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat other criteria were imposed by the Badinter Commission on the former Yugoslav republics?\nA. The Commission required a commitment to submit disputes to the ICJ\nB. The Commission required a change in boundaries\nC. The Commission required a commitment to human rights and democracy\nD. The Commission required an exchange of ethnic populations\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nHow treaties are to be interpreted?\nA. Treaties are to be interpreted in good faith in accordance with the ordinary meaning to be given to the terms of the treaty in their context and in the light of its object and purpose\nB. Treaties are to be interpreted only in accordance with the ordinary meaning of their terms\nC. Treaties are to be interpreted in accordance with the intention of the parties, as evidenced in the preparatory works of the treaty\nD. Treaties are to be interpreted only in light of its object and purpose\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhen coastal States do enforce their criminal jurisdiction over foreign vessels in their ports?\nA. Port States generally do not enforce their criminal jurisdiction over crimes that do not infringe their customs laws or disrupt peace and public order.\nB. Port States enforce their jurisdiction in all cases of delinquent vessels\nC. Port States enforce their jurisdiction only in respect of very serious crimes, such as drug trafficking\nD. Port States are not entitled to enforce their jurisdiction over any foreign vessel\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the value of the Resolutions of the UN General Assembly in terms as a 'source' of international law?\nA. GA Resolutions are considered as additional sources of international law and thus binding upon States\nB. GA Resolutions are equivalent to treaties\nC. GA Resolutions reflect always customary law\nD. GA Resolutions are considered as material source, in the sense that they may enunciate statements of customary law\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nDo treaties bind third States, ie non-State parties?\nA. Treaties may create only rights for third States\nB. Treaties create both obligations and rights for third States\nC. Treaties do no create obligations or rights for third States without their consent\nD. Treaties do not create any obligations or rights for third States, even when the latter consent.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following articles are not qualified rights?\nA. Article 3\nB. Article 8\nC. Article 9\nD. Article 11\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is dualism?\nA. Dualism suggests that international and domestic law are part of a unified legal system\nB. Under dualism, international and domestic laws comprise distinct legal Systems\nC. Dualism suggests that international and domestic law are distinct but equal in hierarchy\nD. Dualism suggests that international and domestic law are distinct legal systems whereby domestic law always prevails\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is an act jure imperii?\nA. An act is jure imperii when undertaken by an international organisation\nB. An act is jure imperii when undertaken in an official State capacity\nC. All acts undertaken by State officials are acts jure imperii\nD. An act is jure imperii when undertaken by a State corporation\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the relationship between the formal sources of international law?\nA. There is no hierarchy between the formal sources of international law\nB. Treaties supersede custom\nC. Custom supersedes treaties\nD. General Principles of Law supersede both custom and treaties\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat was the particular advantage of UNSC Resolution 678 over a collective defensive action under Article 51 UN Charter during the Gulf War?\nA. Resolution 678 allowed the allies to attack Iraq with nuclear and chemical weapons\nB. Resolution 678 is narrower than the inherent right of self-defence under Article 51 UN Charter\nC. Resolution 678 was faster to adopt and negotiate.\nD. Resolution 678 is broader because it authorised the use of force with respect to any matter threatening the peace and security of the Gulf region.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nHow can customary law be related to treaty provisions?\nA. Treaties may only codify customary law\nB. Customary law is a different source of international and it cannot be embodied in treaties\nC. Treaties may 1) codify customary law, 2) 'crystallise' customary law, 3) lead to the emergence of customary law\nD. Customary law can emerge only from few multilateral treaties\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat does it mean for a State to be sovereign?\nA. Sovereignty means being recognised by all other States\nB. Sovereignty means to be able to enter into treaties and join the UN\nC. Sovereignty means freedom to determine one's own affairs without external interference\nD. Sovereignty means possessing the right to defend oneself\n\nResponse:\n"
    ],
    "obj_label": [
      "C",
      "B",
      "A",
      "C",
      "A",
      "B",
      "C",
      "C",
      "C",
      "A",
      "A",
      "D",
      "C",
      "A",
      "B",
      "B",
      "A",
      "D",
      "C",
      "C"
    ],
    "relation_name": "international_law"
  },
  "f0f267ce-e36e-48d4-8f9c-c7df91ae2d16": {
    "sentences": [
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the meaning of functional recognition?\nA. Recognition is a function as opposed to a power\nB. Recognition is reciprocal between two States\nC. Recognition is only afforded to particular administrative acts not to the entity's declared statehood\nD. Recognition is only afforded to the government, not the State\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the meaning of \"act of State\" doctrine?\nA. The act of State doctrine denotes that all State acts attract immunity\nB. The act of State doctrine denotes that the assessment as to the existence of an alleged tort committed by a State belongs to the executive and not the courts\nC. The act of State doctrine denotes that the courts are well placed to assess the existence of an alleged tort committed by the State\nD. The act of State doctrine is a legal mechanism that allows the courts to provide immunity to public acts of foreign States\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nHow can the structure of the international society be displayed?\nA. The structure of the international society follows the vertical model of the domestic legal orders\nB. International society consists of a constellation of sovereign States and other international organizations, which are dispersed in a rather horizontal order of authority\nC. International society is so anarchical that there is no order of authority, neither vertical nor horizontal\nD. The structure of the international society resembles the structure of the most powerful nations in the world\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nAre there any limitations to the incorporation of customary crimes under English law?\nA. There are no limitations to the incorporation of customary crimes\nB. Customary crimes must be contained in a multilateral treaty in order to be automatically incorporated\nC. The courts may freely incorporate customary crimes into the domestic sphere\nD. The situation is not clear-cut but an act of parliament would most probably be required\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the function of the contiguous zone?\nA. The contiguous zone functions as security zone of the coastal State\nB. The contiguous zone is a zone, in which the coastal State may explore and exploit its mineral resources\nC. The contiguous zone is a zone in which the coastal State is permitted to prevent and punish infringements of customs, fiscal, immigration or sanitary laws\nD. The contiguous zone is a zone in which the coastal State safeguards its archaeological and historical objects\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the examples below has not been developed by the European Court of Human Rights as a situation where the state has a positive obligation to protect?\nA. When the applicant is in the custody of the state\nB. Where the state must investigate claims against it\nC. The development of a legal framework to protect those within the state\nD. To provide housing for all those homeless within a state\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich case was the first to define the meaning of the doctrine of 'margin of appreciation' as applied by the European Court of Human Rights?\nA. Goodwin v UK (2002)\nB. Airey v Ireland (1979)\nC. Osman v UK ( 1998)\nD. Handyside v UK (1976)\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nHow are the members of the arbitral tribunal appointed?\nA. All the members of the arbitral tribunal are appointed by the parties\nB. All the members of the arbitral tribunal are appointed by the parties\nC. All the members of the arbitral tribunal are appointed by an impartial third party, such as the president of the ICJ\nD. All the members of the arbitral tribunal are appointed by the parties from a restricted list of arbitrators\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nAre the peremptory norms of international law the only norms that set out obligations erga omnes?\nA. Yes\nB. No, acts of international organizations also set out such obligations\nC. No, decisions of international courts also set out such obligations\nD. No, even though all peremptory norms set out obligations erga omnes, the latter may also spring from treaties regulating objective regimes or unilateral acts\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the constitutive theory of recognition?\nA. Recognition is determinative of statehood\nB. Recognition requires constitutional approval by third nations\nC. Recognition requires that the constitution of the recognised State includes sufficient human rights guarantees\nD. Countries wishing to be recognised must possess a valid constitution\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThe enforcement mechanism of the International Covenant on Civil and Political Rights (and Protocol) consists of\nA. A reporting mechanism only\nB. Judgment of an international tribunal\nC. Right to individual petition only\nD. A reporting mechanism and right to individual petition\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIs piracy under international (jure gentium) law subject to universal jurisdiction?\nA. Piracy jure gentium is subject to flag State jurisdiction\nB. Piracy jure gentium is subject to universal jurisdiction\nC. Piracy jure gentium is subject to port State jurisdiction\nD. Piracy jure gentium is subject to nationality-based jurisdiction\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat are self-executing treaties?\nA. Self-executing treaties are adopted only by the executive\nB. Self-executive treaties are clear and precise enough so as not to require any further implementing measures\nC. Self-executing rely on implementing measures stipulated in the treaty Itself\nD. Self-executing treaties follow the doctrine of transformation\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIs the ICJ hostile to the idea that an armed attack may arise through a series of lower intensity, yet cumulative, instances of armed force?\nA. The ICJ was not hostile to the accumulation theory\nB. The concept of an armed attack refers to a single attack, not multiple smaller instances of armed force\nC. In the Nicaragua case the ICJ dismissed the accumulation theory\nD. The ICJ has never addressed this issue\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nDo third States enjoy any fishing rights within the Exclusive Economic Zone of another State?\nA. When the coastal State cannot harvest the 'total allowable catch', the coastal State is to give other State access to that surplus with priority to be given to developing and land-locked States\nB. Third States may never have access to fisheries within another State's EEZ\nC. The coastal State is to give access to fisheries within its EEZ only to neighbouring States\nD. Third States are free to fish within another EEZ, except from certain designated areas\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the purpose of sovereign immunity?\nA. The purpose of immunity is to protect foreign Heads of State from embarrassment\nB. Immunity protects a State from being invaded by another\nC. Immunity shields States from being sued in the courts of other States\nD. The purpose of immunity is to offer impunity in respect of all crimes\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is passive personality jurisdiction?\nA. It is jurisdiction based on the nationality of the offender\nB. It is jurisdiction based on where the offence was committed\nC. It is jurisdiction based on the nationality of the victims\nD. It is jurisdiction based on the country where the legal person was Registered\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following types of rights have been described as first generation rights?\nA. Social and economic rights\nB. Civil and political rights\nC. Cultural rights\nD. People's rights\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is functional (ratione materiae) immunity?\nA. Functional immunity covers the person but not the act\nB. Functional immunity covers the act and incidentally also the person committing the act\nC. Functional immunity covers the State and incidentally also the act\nD. Functional immunity covers both private and public acts as long as they are sanctioned by the State\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the meaning of implied authorisation?\nA. Presumption of Security Council approval of armed force when a State has been forewarned\nB. Implicit authorisation on the basis of a specific number of votes by UNSC members\nC. Presumption that all unlawful attacks will be subject to armed force by a resolution of the UNSC\nD. In cases of repeated unlawful attacks the UNSC shall authorise neighbouring States to take whatever measures they deem necessary to rectify the situation\n\nResponse:\n"
    ],
    "obj_label": [
      "C",
      "B",
      "B",
      "D",
      "C",
      "D",
      "D",
      "A",
      "D",
      "A",
      "D",
      "B",
      "B",
      "A",
      "A",
      "C",
      "C",
      "B",
      "B",
      "A"
    ],
    "relation_name": "international_law"
  },
  "505f2f67-4b55-4631-805e-2556fdbef626": {
    "sentences": [
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich philosopher called the idea of natural rights 'nonsense on stilts'?\nA. Alan Gerwith\nB. Emmanuel Kant\nC. John Locke\nD. Jeremy Bentham\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWho is a 'persistent objector'?\nA. The State which persistently objects to the rule in question after its formation\nB. The State which denies to be bound by the rule in question for a short period\nC. The State which persistently and publicly objects to the formation of a rule of customary law from its outset\nD. The State which accepts the formation of a rule of customary law but it retains objections as to its content\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the meaning of collective security?\nA. The right to self-defence by more than one nation acting in concert\nB. The right of one's allies to defend the victim State\nC. The authorisation of armed force by the UN Security Council\nD. The authorisation of peacekeeping missions by the UN General Assembly\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThe European Convention on Human Rights is predominantly concerned with which of the following?\nA. Economic and social rights\nB. Environmental rights\nC. Civil and political rights\nD. Economic freedom\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIs the jurisdiction of international tribunals regulated by the same principles applicable to national courts?\nA. The jurisdictional principles applicable to national courts are also common to international tribunals\nB. The jurisdiction of all international tribunals is regulated by the UN Security Council\nC. International tribunals share some, but not all, of the jurisdictional principles applicable to national courts\nD. The jurisdiction of international tribunals is dictated solely by their founding treaties\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the meaning of collective rights?\nA. Collective rights belong to distinct groups of people\nB. Collective rights are those that belong to particular groups as opposed to the individual members of the group\nC. Minority rights are collective rights\nD. Collective rights entail a right of the group as such as well as individual rights of the group's members\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nAre States under any obligation when they conduct negotiations?\nA. States are under no obligation as to how they conduct their negotiation\nB. States are under an obligation so to conduct themselves that the negotiations are meaningful\nC. States are under an obligation to find a solution of the dispute whenever they conduct negotiations\nD. States are under an obligation to inform the UN Secretary-General about the progress of their negotiations\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is an 'internationally wrongful conduct'?\nA. An international wrongful conduct is an action or omission which is in breach of a rule of international criminal law\nB. An international wrongful conduct is every breach of an international obligation of the State, whether attributable to it or not\nC. An internationally wrongful conduct consists of an action or omission attributable to the State, which constitutes a breach of an international obligation of the State\nD. An internationally wrongful conduct is the conduct that cannot be excused on grounds of necessity, force majeure etc.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the effects doctrine?\nA. It posits that jurisdiction exists only when it is effective\nB. The effects doctrine serves to confer jurisdiction on the State which has an effective link with the harmful conduct\nC. The effects doctrine serves to confer jurisdiction on the State sharing the nationality of the offender\nD. The effects doctrine serves to confer jurisdiction to the State on whose territory the conduct produces effects\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the fundamental prerequisite for the incorporation of custom under English law?\nA. Custom is incorporated if it is not in conflict with existing legislation\nB. Custom is superior to English law and is always incorporated\nC. Custom must first be recognised by Parliament before the courts can bring it into the domestic sphere\nD. Custom is incorporated with the passing of implementing legislation\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWas the use of armed force permitted prior to the United Nations Charter?\nA. Armed force was prohibited\nB. Armed force was permitted with no restrictions\nC. Armed force was permitted subject to few restrictions\nD. Armed force was not regulated under international law prior to 1945\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the protective principle of jurisdiction?\nA. It is jurisdiction based on the harm to national interests by conduct committed abroad\nB. It is jurisdiction in order to protect one's nationals abroad\nC. It is jurisdiction in order to protect international human rights\nD. It is jurisdiction based on the nationality of the offender\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich one of the following statements is correct?\nA. The Council of Europe was established in 1950 and consists of 27 member states\nB. The Council of Europe was established in 1949 and consists of 47 member states\nC. The Council of Europe was established in 1959 and consists of 34 member states\nD. The Council of Europe was established in 1984 and consists of 19 member states\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is a derogation?\nA. Derogations are exemptions from particular human rights obligations contained in a treaty\nB. A derogation refers to the ability of rights holders to bring a claim against the State for breach of an obligation\nC. A State may suspend particular rights by means of a derogation in circumstances that threaten its existence\nD. Derogations are enforcement clauses in human rights treaties\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is an act jure gestionis?\nA. Acts jure gestionis are those undertaken by States in a private capacity\nB. All purchases by the State are acts jure gestionis\nC. All acts undertaken by State corporations are jure gestionis\nD. All conduct undertaken by government officials in their free time is considered jus gestionis.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the meaning of cultural relativism?\nA. Culture relativism posits that human rights apply equally to all without restrictions\nB. Culture relativism posits that human rights have a cultural origin\nC. Cultural relativism posits that the application of human rights is relative to the laws in each nation\nD. Cultural relativism posits that local culture should validate the existence and practice of all human rights\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIs recognition of governments prevalent in contemporary international practice?\nA. Recognition of governments is very prevalent in contemporary practice\nB. Recognition of governments has largely been replaced by functional Recognition\nC. Government recognition is common in respect of rebel entities\nD. Only democratic governments are recognised in contemporary practice\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the legal nature of the Universal Declaration of Human Rights (UDHR)?\nA. The UDHR is a multilateral treaty\nB. The UDHR is a UN General Assembly resolution\nC. The UDHR is a UN Security Council resolution\nD. The UDHR is a declaration adopted by several States at an international conference\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nUnder what circumstances do human rights violations taking place outside the territory of ECHR member States fall within the remit of the ECHR?\nA. The ECHR applies outside Europe where human rights are violated by ECHR member States abroad\nB. The ECHR applies extraterritorially in circumstances where a member State exercises effective control\nC. The ECHR applies extraterritorially where a member State has contributed forces to a UN peacekeeping mission\nD. The ECHR applies extraterritorially where human rights violations are taking place in former colonies of member States\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat does the principle 'pacta sunt servanda' mean?\nA. Parties to a treaty should be cognizant of its terms and not misinterpret them\nB. Parties to a treaty should safeguard the object and purpose of the treaty\nC. Parties to a treaty should adhere to its terms in good faith\nD. Parties to a treaty should not violate the most important provisions of the treaty\n\nResponse:\n"
    ],
    "obj_label": [
      "D",
      "C",
      "C",
      "C",
      "D",
      "B",
      "B",
      "C",
      "D",
      "A",
      "C",
      "A",
      "B",
      "C",
      "A",
      "D",
      "B",
      "B",
      "B",
      "C"
    ],
    "relation_name": "international_law"
  },
  "b692a6af-417f-49c4-8d78-dd35fa0b15ee": {
    "sentences": [
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following statements is true?\nA. The Human Rights Act 1998 incorporates the European Convention on Human Rights into UK law\nB. The Human Rights Act 1998 allows a court to invalidate primary legislation\nC. The Human Rights Act 1998 allows any person with a reasonable case to bring a case before a court\nD. The Human Rights Act 1998 incorporates the EU charter of fundamental rights into UK law\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat forms may the obligation of reparation take?\nA. Reparation may take only the form of pecuniary compensation, including the interest\nB. Reparation denotes only the physical restitution of the wrongful act\nC. Reparation includes restitution, compensation, and satisfaction, either alone or alongside other forms of reparation\nD. The form of reparation is a matter for the responsible State to decide\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is jus cogens?\nA. They are peremptory norms of international law, from which no derogations are allowed and which can never be altered even with the consent of the States\nB. They are rules of international law that are laid down in multilateral treaties with a wide participation\nC. They are the decisions of the UN Security Council\nD. They are the rules of international law on which the ICJ founds its decisions\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is 'unilateral acts'?\nA. They are acts that States perform as practice in the context of custom\nB. They are acts creating unilateral legal obligations to the acting State\nC. Unilateral acts are simply political acts of State devoid of any legal effect\nD. Unilateral acts are those that State perform in order to be bound by a treaty\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIs extra-territorial abduction a ground for refusal of otherwise lawful jurisdiction by English courts?\nA. Such abduction constitutes abuse of process and leads to a stay of proceedings\nB. Such abduction gives rise to the abductor's liability but does not lead to a stay of proceedings\nC. The stay of proceedings under such circumstances would prevent the administration of justice in respect of international criminals\nD. The courts may, but will seldom, stay proceedings in cases of extra-territorial abduction\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the meaning of 'secondary rules' in the law of international responsibility?\nA. Secondary rules are the rules of interpretation of international law, including the law of international responsibility\nB. Secondary rules are the rules that govern the legal consequences arising from a breach of the primary rules, ie of the international obligations of the States\nC. Secondary rules are the rules that govern exclusively the concept of attribution in the law of international responsibility\nD. Secondary rules are the rules that govern exclusively the law of countermeasures\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat does the doctrine of incorporation suggest in respect of treaties?\nA. The doctrine of incorporation requires that all treaties undergo legislative transformation before they become domestic law\nB. The doctrine of incorporation does not require any further action at the domestic level\nC. The doctrine of incorporation treats treaties as inferior to domestic law\nD. The doctrine of incorporation suggests that ratified treaties automatically pass into the sphere of domestic law\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nAre the provisional measures issued by the ICJ binding upon the parties?\nA. No, according to the literal interpretation of the relevant provision of the State, the provisional measures are not binding\nB. No, unless the parties have agreed so beforehand\nC. It depends upon the Court whether the provisional measures will be binding\nD. Yes, it has been consistently held by the Court since the La Grand case (2001) that they are binding\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhen are countermeasures illegal?\nA. Countermeasures are illegal when inter alia are disproportionate or in violation of a peremptory norm of international law (e.g. the use of force, human rights)\nB. Countermeasures are illegal when they are taken in the course of an armed conflict\nC. Countermeasures are illegal when they violate bilateral treaties\nD. Countermeasures are illegal when the responsible State does not consent to them\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following cases best illustrates the 'living instrument principle' used by the European Court of Human Rights?\nA. Golder v UK (1978)\nB. A v UK (2009)\nC. Goodwin v UK (2002)\nD. Osman v UK (1998)\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIs the recognition of foreign judgments subject to the same rules as those applicable to the incorporation and transformation of treaties?\nA. Foreign judgments are enforced on the basis of the doctrine of incorporation\nB. Foreign judgments are enforced on the basis of the doctrine of transformation\nC. The recognition of foreign judgments is dependent on the existence of appropriate bilateral or multilateral treaties\nD. The courts exercise discretion as to the enforcement of foreign judgments on the basis of the rule of comity\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat was the most important finding by the House of Lords in the Pinochet case?\nA. The Pinochet case confirmed that former heads of State enjoy absolute immunity\nB. The Pinochet case confirmed that all public acts enjoy immunity\nC. The Pinochet case confirmed that former heads of State cease to enjoy personal immunity once removed from office\nD. The Pinochet case confirmed that in respect of immunities there is no difference between a current and a former head of State\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich one of the statements below is false?\nA. The war crimes trials at Nuremberg and Tokyo took place immediately after the First World War\nB. The war crimes trials introduced a 'crime against humanity' as an offence\nC. The war crimes trials held individuals legally responsible for acts such as war crimes and crimes against humanity\nD. The war crimes trials found that \"superior orders\" could not be used as a defence for war crimes or crimes against humanity\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich State exercises jurisdiction over vessels on the high seas?\nA. All States may exercise jurisdiction over foreign vessels on the high seas\nB. States may exercise jurisdiction over foreign vessels on the high seas only in cases of criminal activity that concerns them\nC. The flag State is to exercise exclusive jurisdiction over its vessels on the high seas, with the exception of specific cases, such as piracy\nD. The flag State is the only State to exercise exclusive jurisdiction over its vessels on the high seas with no exception\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nShould treaties assume a particular form?\nA. Treaties should always be designated as such and assume a particular form\nB. Treaties should always assume a particular form, no matter how they are designated\nC. Treaties do not have to assume a particular form or designated as such\nD. Treaties have to be designated as such, no matter what form they assume\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the fundamental premise of monist theory?\nA. Monism posits that international law is superior to domestic laws\nB. Monism posits that international and domestic law are part of the same legal order\nC. Monism posits that domestic laws are superior to international law\nD. Monism posits that domestic and international law never clash\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhere do we find the 'general principles of law recognized by civilized nations' (article 38 ICJ Statute)?\nA. We look for established principles of law recognized only among the most civilised nations\nB. We look for established principles of law, which are common to all major legal systems\nC. We look for general principles of international law recognized by international courts and tribunals\nD. We look for general principles of law recognized by all nations\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhen does an illegal act of violence on the high seas fall short of qualifying as piracy?\nA. When it is committed against a public vessel of another State\nB. When it is committed for 'private ends'\nC. When it is committed by a warship even when its crew has mutinied and taken control of the ship\nD. When it is not committed against another vessel and when it is not committed for 'private ends'\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the meaning of \"armed attack\" in Article 51 UN Charter?\nA. Armed attack includes all types of armed force\nB. Armed attack includes all high intensity instances of armed force\nC. Armed attack includes terrorist attacks\nD. An \"armed attack\" gives the right to invade the aggressor State\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWho is an 'injured State' in the law of international responsibility?\nA. A State is 'injured' in case that it has suffered a damage from the internationally wrongful conduct\nB. A State is 'injured' in cases that there has been a violation of a peremptory norm of international law\nC. A State is 'injured' should it acknowledge the existence of the internationally wrongful conduct\nD. A State is 'injured' if the obligation breached was owed to it individually or if it was owed to a group of States, including that State, and it was specially affected\n\nResponse:\n"
    ],
    "obj_label": [
      "A",
      "C",
      "A",
      "B",
      "A",
      "B",
      "D",
      "D",
      "A",
      "C",
      "C",
      "C",
      "A",
      "C",
      "C",
      "B",
      "B",
      "D",
      "B",
      "D"
    ],
    "relation_name": "international_law"
  },
  "ef9a59ea-2725-4c43-904e-c869b3fc337b": {
    "sentences": [
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is personal (ratione personae) immunity?\nA. Personal immunity is afforded to all physical persons\nB. Personal immunity is that which is afforded in a personal capacity and hence does not cover conduct of the State as such\nC. Personal immunity is afforded only to particular persons irrespective if their conduct was undertaken in a private or public capacity\nD. Personal immunity is afforded to State officials for conduct undertaken in a public capacity\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following statements best describes the UN Human Rights Council?\nA. The UN Human Rights Council has the power to impose economic sanctions on a state for human rights violations\nB. The UN Human Rights Council scrutinises the human rights records of member states on the Council and each member state of the UN\nC. The UN Human Rights Council replaced the Economic and Social Committee of the UN\nD. The UN Human Rights Council consists of 27 member states\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhen a reservation is considered as invalid under the law of treaties?\nA. A reservation is invalid when the majority of the State parties objects to it\nB. A reservation is invalid only when an international tribunal says so\nC. A reservation is invalid only when is incompatible with a peremptory norm of international law (jus cogens)\nD. A reservation is invalid when it is incompatible with the object and purpose of the treaty\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nAre there any limits to the application of article 103 of the UN Charter?\nA. No, there are no limits to article 103\nB. Yes, Article 103 cannot trump multilateral treaties\nC. Yes, article 103 of the UN Charter cannot trump jus cogens norms\nD. Yes, when a case is submitted to the ICJ, article 103 ceases to have any effect\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nCan countries rely on their domestic law as an excuse to violate their obligations under international law?\nA. Domestic law always prevails over international law\nB. Only customary international law prevails over domestic law\nC. Obligations under international law prevail over domestic law\nD. Constitutional obligations always prevail over obligations under international law\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is meant by an international organisation's implied powers?\nA. Implied are those powers which are necessary in order for an organisation to carry out the tasks conferred upon it and which are not stipulated in its charter\nB. It refers to new powers assumed unilaterally by the organisation\nC. It refers to powers conferred upon the organisation by the international Community\nD. Implied powers are those whose determination depends on an expansive interpretation of an organisation's charter\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat are the criteria for statehood under the 1933 Montevideo Convention?\nA. It requires that the entity in question is not an aggressor and that it is peaceful\nB. It requires recognition by the majority of other nations\nC. It requires a permanent population, a defined territory, a government and a capacity to enter into foreign relations\nD. It requires stable and indissoluble borders as well as recognition\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat kind of passage does qualify as 'innocent passage'?\nA. Innocent passage is the passage that does not involve any criminal activity\nB. A vessel's passage is considered 'innocent' where it is not prejudicial to the peace, good order or security of the coastal State\nC. Innocent passage concerns only vessels of the same nationality with the coastal State\nD. Innocent passage concerns only the passage of merchant vessels and not of warships\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat kind of State practice is required?\nA. Widespread, consistent and uniform practice, consisting both of acts and omissions.\nB. Only widespread, consistent and uniform acts and not omissions of States\nC. Widespread acts and omissions of States but not necessarily consistent or uniform\nD. Consistent practice of few States, including both acts and omissions, which is met with protestation by the other States\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich treaties are considered as 'source of international law' under article 38 ICJ Statute?\nA. All treaties that are in force at the time of the dispute\nB. Only the treaties that are in force and binding upon the parties to the dispute\nC. All treaties that have been concluded between the parties to the dispute, regardless whether they are in force\nD. Only treaties that are multilateral and of paramount significance\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nCan armed violence perpetrated by non-State actors ever amount to an armed attack under Article 51 UN Charter?\nA. The conduct of non-State actors can never amount to an armed attack\nB. The Caroline case serves as precedent that non-State actors can under particular circumstances commit an armed attack\nC. There is no precedent in international law for the proposition that non-State actors can commit an armed attack\nD. Non-State can both commit an armed attack and possess a right of self-defence under international law\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following statements is inaccurate?\nA. Proportionality is a means of balancing the rights of an individual against the protection of the community as a whole\nB. For an act to be proportionate, it should be linked to the legitimate aim of the state measure complained of\nC. Proportionality is the same as reasonableness\nD. Proportionality should mean the state takes the least intrusive action that is necessary\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIn the Grootboom case in South Africa the Supreme Court\nA. Found the state was responsible for the homelessness of the appellants and that they had to provide the appellants with a certain type of housing as soon as possible\nB. Found the state was responsible for the homelessness of the appellants but that the right to housing was not enforceable by the Court\nC. Found that the state had to take reasonable steps to fulfil its obligation to the appellants under the right to housing in the Constitution\nD. Found the state was not responsible for the appellants' homelessness\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich rule of jus cogens was the first to be accepted explicitly as such by the ICJ?\nA. The prohibition of the use of force\nB. The prohibition of torture\nC. The prohibition of genocide\nD. The principle of self-determination\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nMay States incur liability for the debts and wrongdoings attributable to an international organisation to which they are parties?\nA. Member States cannot hide behind an organisation's corporate veil\nB. The legal person of the organisation is distinct from that of its member States\nC. Organisations and their member States are equally liable for any wrongdoings attributable to the organisation\nD. Member States are alone liable for debts and wrongdoings attributable to the organisation\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is required for a general rule of customary law to be formed?\nA. Only general, widespread and consistent practice on the part of States is required\nB. The consistent practice of few States is sufficient\nC. The legal conviction that a certain practice of a State is in accordance with international law is the most significant requirement\nD. Both the elements of widespread and consistent State practice and of the opinio juris are required\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is 'material breach' of the treaty?\nA. 'Material breach' is a ground for the invalidation of a treaty\nB. 'Material breach' is the repudiation or a significant violation of the treaty and serves as a ground for the unilateral termination of the treaty\nC. 'Material breach' is an insignificant violation of a treaty\nD. Material breach' is a significant violation of the treaty which can never lead to the termination of the treaty\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat types of force does Article 2(4) of the UN Charter prohibit?\nA. Article 2(4) encompasses only armed force\nB. Article 2(4) encompasses all types of force, including sanctions\nC. Article 2(4) encompasses all interference in the domestic affairs of States\nD. Article 2(4) encompasses force directed only against a State's territorial integrity\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the judge ad hoc?\nA. If a party to a contentious case before the ICJ does not have a national sitting as judge, it is entitled to nominate someone as a judge solely for that case, with the title of judge ad hoc\nB. Judge ad hoc is the member of the bench of the ICJ with a casting vote\nC. Judge ad hoc is a surrogate judge, in case a judge is disqualified or passes away\nD. Judge ad hoc is the judge that each party will always nominate in every contentious case\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWould a reservation to the definition of torture in the ICCPR be acceptable in contemporary practice?\nA. This is an acceptable reservation if the reserving country's legislation employs a different definition\nB. This is an unacceptable reservation because it contravenes the object and purpose of the ICCPR\nC. This is an unacceptable reservation because the definition of torture in the ICCPR is consistent with customary international law\nD. This is an acceptable reservation because under general international law States have the right to enter reservations to treaties\n\nResponse:\n"
    ],
    "obj_label": [
      "C",
      "B",
      "D",
      "C",
      "C",
      "A",
      "C",
      "B",
      "A",
      "B",
      "B",
      "C",
      "C",
      "C",
      "B",
      "D",
      "B",
      "A",
      "A",
      "B"
    ],
    "relation_name": "international_law"
  },
  "3f511c7d-e402-403f-99bb-2f3c6ac8ecca": {
    "sentences": [
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhen 'consent' can serve as a circumstance precluding the wrongfulness of a State conduct?\nA. Consent can serve as a circumstance precluding the wrongfulness whenever it is given\nB. Consent can never serve as a circumstance precluding wrongfulness\nC. Consent can serve as a circumstance precluding wrongfulness, provided the consent is valid and to the extent that the conduct remains within the limits of the consent given\nD. Consent can always serve as a circumstance precluding wrongfulness, no matter which organ of the State gives it\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nHow the consent to be bound of a State may be expressed?\nA. The consent of a State to be bound is expressed only by ratification\nB. The consent of a state to be bound by a treaty may be expressed by signature, ratification, acceptance, approval or accession\nC. The consent of a State to be bound is expressed by signature\nD. The consent of a State to be bound is expressed by whatever means they choose\n\nResponse:\n"
    ],
    "obj_label": [
      "C",
      "B"
    ],
    "relation_name": "international_law"
  },
  "ae28a5bc-d365-4983-b444-73979cf75b0c": {
    "sentences": [
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich statement best explains the purpose of Hart's distinction between 'being obliged' and 'having an obligation'?\nA. It demonstrates the difference between the internal and the external aspect of a rule.\nB. It refutes the natural lawyer' view of the role of morality in law.\nC. It explains the nature of power-conferring rules.\nD. It illuminates the concept of a rule.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nMaine's famous aphorism that 'the movement of progressive societies has hitherto been a movement from Status to Contract' is often misunderstood. In what way?\nA. It is misinterpreted as a prediction.\nB. His concept of status is misrepresented.\nC. It is taken literally.\nD. His idea is considered inapplicable to Western legal systems.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following factors contributed significantly to the revival of natural law in the 20th century?\nA. Depression of the 1930\nB. The rise of Fascism\nC. The international recognition of human rights after World War II\nD. The Bolshevik Revolution\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following criticisms of Llewellyn's distinction between the grand and formal styles of legal reasoning is the most compelling?\nA. There is no distinction between the two forms of legal reasoning.\nB. Judges are appointed to interpret the law, not to make it.\nC. It is misleading to pigeon-hole judges in this way.\nD. Judicial reasoning is always formal.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich proposition below is the most consistent with what Rawls claims the POP would opt for in respect of 'social primary goods'?\nA. The POP will choose wealth over a compassionate society.\nB. The POP will choose equality over power.\nC. The POP will be unselfish.\nD. The POP will choose to protect the disabled.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThe ________ School believes that promoting market efficiency should be the central goal of legal decision-making.\nA. Law and Economics\nB. Critical Legal Studies\nC. Historical\nD. Natural Law\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich statement below is the least likely to follow logically from Austin's argument that a sanction consists of the smallest chance of incurring the smallest evil?\nA. All commands include some sanction.\nB. The concept of a command contains the likelihood that a sanction will follow failure to obey the command.\nC. Without a sanction the mere expression of a wish is not a command.\nD. A command confers power to change one's legal status.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nHow does Weber solve the 'England problem'?\nA. By denying its existence.\nB. By explaining the difference between the common law and civil law.\nC. By distinguishing certain features of the English legal system that facilitated the development of capitalism.\nD. By recognizing the importance of legitimate domination.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nCicero's conception of natural law is 'based on the idea that 'true law is right reason in agreement with Nature.' Reason is a key element because:\nA. It is a sin for humans not to apply reason.\nB. The principles of natural law are discoverable by reason.\nC. Natural law does not apply without good reason.\nD. The law of nature is the basis of all positive law.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nCatharine MacKinnon argues that since men dominate women, the question is ultimately one of power. Which proposition below is the most inconsistent with this argument?\nA. Women can achieve equality through political pressure.\nB. Equality is impossible because men define women as different.\nC. The idea of 'woman' needs to be redefined.\nD. The world is phallocentric and oppressive.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWho was an exponent of “natural law with a variable content”?\nA. John Rawls\nB. Stammler\nC. Jerome Hall\nD. John Finns\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThe ________ School of jurisprudence asserts that the law is a means of achieving and advancing certain sociological goals.\nA. Historical\nB. Analytical\nC. Command\nD. Sociological\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nAccording to Malinowski, the Trobriand Islanders organized their society around what concept?\nA. Conflict.\nB. Love.\nC. War.\nD. Reciprocity.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIn Justice for Hedgehogs Dworkin endorses 'Hume's principle'. What does he understand by this idea?\nA. That there is no distinction between law and morality.\nB. That there is a distinction between right and wrong.\nC. That facts about the world or human nature cannot normally ordain what ought to be\nD. That human rights are fundamentally unsound.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nLyotard's dictum 'I define postmodern as incredulity toward meta-narratives' means:\nA. Individual stories are suspect.\nB. The law is static.\nC. Universal values are meaningless.\nD. Literature reproduces repression.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nTo claim that one has a prima facie duty to obey the law is to assert that:\nA. One is under a duty to obey the law without exception, regardless of its content.\nB. There is no duty to obey a law to which one hasn't agreed.\nC. The duty applies only to those who are directly affected by the law in question.\nD. The obligation arises independently of the precise legal provisions involved - unless there are grounds to justify a specific exception.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nDworkin contends that to every legal question there is only one right answer. Which proposition below is most inconsistent with this claim?\nA. In hard cases judges generally decide cases on the basis of rights.\nB. The rights of the parties feature in the determination of most cases before the courts.\nC. Judges exercise strong discretion.\nD. Judges seek the best 'fit' with constitutional and institutional history.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nRobert makes the following statement while negotiating the sale of his car, 'This is the sharpest car on the market.' His statement may support a claim for:\nA. misrepresentation\nB. fraud\nC. fraud and misrepresentation\nD. none of the above\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nAccording to Austin the science of jurisprudence is concerned with\nA. Morality\nB. Positive law\nC. Divine law\nD. Natural law\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following statements best captures the nature of Fuller's 'inner morality of law'?\nA. A positivist view of law.\nB. A morality of aspiration.\nC. An Aquinian concept of natural law.\nD. A rejection of the 'harm principle'.\n\nResponse:\n"
    ],
    "obj_label": [
      "D",
      "A",
      "C",
      "C",
      "A",
      "A",
      "D",
      "C",
      "B",
      "A",
      "B",
      "D",
      "D",
      "C",
      "C",
      "D",
      "C",
      "D",
      "B",
      "B"
    ],
    "relation_name": "jurisprudence"
  },
  "7ff217ed-8a51-4f92-b5e4-fa205665882d": {
    "sentences": [
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nHart argues that secondary rules are 'power-conferring' but this seems unconvincing in the case of the rule of recognition because:\nA. It both confers power and imposes duties on judges to decide cases.\nB. It is not a social rule.\nC. It applies only in the case of unitary constitutions.\nD. It fails to specify the source of authority.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nAdherence to precedent is called the doctrine of ________.\nA. nolo contendere\nB. stare decisis\nC. substantial performance\nD. commercial impracticability\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich proposition below may be characterized as the most powerful refutation by Hart of Lord Devlin's argument?\nA. Society has no right to preserve its moral and social cohesion through the criminal law.\nB. Homosexual acts cause public outrage.\nC. The courts are the best place to resolve moral questions such as those concerning homosexuality and prostitution.\nD. The law is anachronistic.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat relationships to the type of law that exists in society does Durkheim identify between (1) mechanical and (2) organic solidarity?\nA. Mechanical solidarity produces conflict in society. Organic solidarity leads to greater social harmony.\nB. Mechanical solidarity leads to repressive law. Organic solidarity leads to restitutive law.\nC. Mechanical solidarity fosters efficiency. Organic solidarity leads to inefficiency.\nD. Mechanical solidarity generates a more democratic legal system; organic solidarity a more authoritarian legal system.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following quotations best describes the central thesis of difference feminism?\nA. There are fundamental differences between individual women.'\nB. Men and women have different conceptions of the feminist project.'\nC. Women look to context, whereas men appeal to neutral, abstract notions of justice.'\nD. Men are unable to comprehend their differences from women.'\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich statement below is the least likely to follow logically from Dworkin's notion of law as integrity?\nA. It is likely to generate more individual rights and greater liberty.\nB. It renders a community more genuine.\nC. It opens the door to authoritarianism.\nD. It improves the moral justification for the exercise of political power.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich statement best describes one of Dworkin's central arguments in Justice for Hedgehogs?\nA. Morality plays no role in the concept of law.\nB. Moral arguments operate only in hard cases.\nC. The law dictates what moral values should affect our ethical behaviour.\nD. Moral values are both independent and objective.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich statement best describes the nature and function of Kelsen's Grundnorm?\nA. The ultimate source of a legal system's morality.\nB. The rule that distinguishes norms from habits of obedience.\nC. The constitution of a state.\nD. A presupposition that facilitates our understanding of the legal system.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nCritical Legal Studies (CLS) is often compared to (or with) American realism. Which of the following statements is inaccurate?\nA. Both are concerned with the 'law in action.'\nB. Both are anti-formalist and sceptical\nC. Both adopt a liberal ideology.\nD. Both attempt to demystify the law.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following best describes Dworkin's distinction between principles and policies?\nA. Principles are legislative, policies are precedents.\nB. Principles describe rights, policies describe duties.\nC. Principles are democratic, policies are autocratic.\nD. Principles describe rights, policies describe goals.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nStatutes are often called ________ law.\nA. quasi\nB. qualified\nC. collaborated\nD. codified\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich is the least accurate description of legal positivism?\nA. It regards morals and law as inseparable.\nB. It perceives law as commands.\nC. It regards a legal order as a closed logical system.\nD. It espouses the view that there is no necessary connection between morality and law.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich proposition below is the most powerful refutation of Bentham's felicific calculus?\nA. Happiness is less important than economic prosperity.\nB. It is impossible to calculate all the consequences of one's acts.\nC. Pain and pleasure are inevitable features of life.\nD. Utilitarianism fails to take account of differences in social background.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nDonny threw a knife at Sally, intending to injure her severely. However, Donny missed Sally. Sally saw the knife just as it whizzed by her head, missing it by about one inch. As a result, Sally was very scared. Sally sued Donny for assault and battery. Which of the following is most correct?\nA. Donny will be liable for battery, but not assault.\nB. Donny will be liable for assault, but not battery.\nC. Donny will be liable for assault and for battery.\nD. Donny will not be liable for either assault or battery because this is only a criminal matter.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhy does a Marxist account of law reject individual rights?\nA. Because they are inconsistent with state control.\nB. Because they are an expression of a capitalist economy and are unnecessary in a socialist society.\nC. Because the concept of rights is philosophically unsound.\nD. Because Marx, Engels, and Lenin failed to provide a coherent analysis of rights.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nKelsen’s theory of law is called pure theory because Kelsen :\nA. Purely discussed jurisprudence only\nB. Defined law in according with morality and purity\nC. Separated law from religion, ethics, sociology and history\nD. Discussed law purely in terms of justice\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following purposes does the 'internal point of view' play in Hart's concept of law?\nA. It distinguishes social rules from mere group habits.\nB. It defines the judicial function.\nC. It illustrates the authority of the legislature.\nD. It stresses the relationship between law and justice.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThe body of law which establishes rights between persons and provides for redress for violation of those rights is known as:\nA. Criminal Law\nB. Civil Law.\nC. The Uniform Commercial Code.\nD. Stare decisis.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhy does Parfit oppose equality?\nA. He argues than an unequal society is inevitable.\nB. He claims that by giving priority to the needs of the poor, we can increase equality.\nC. He asserts that we are each responsible for our poverty.\nD. He rejects the idea of equality altogether.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThe most fundamental of positivism's key commitments,' writes Ken Himma, 'is the Social Fact Thesis.' What does it claim?\nA. That law is essentially an artefact or social construction.\nB. That legal systems are unrelated to social forces.\nC. That society is constantly in a state of flux.\nD. That legal positivism is a social theory.\n\nResponse:\n"
    ],
    "obj_label": [
      "A",
      "B",
      "A",
      "B",
      "C",
      "C",
      "D",
      "D",
      "C",
      "D",
      "D",
      "A",
      "B",
      "B",
      "B",
      "A",
      "A",
      "B",
      "B",
      "A"
    ],
    "relation_name": "jurisprudence"
  },
  "315fb53d-ce04-421d-9633-eb37274ac633": {
    "sentences": [
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nHow does Nozick answer the criticism of his historical entitlement theory that if the distribution of goods in society is unjust those at the bottom always lose?\nA. It can be remedied by redistribution of wealth.\nB. If each person's holdings are just, then the total distribution of holdings is just.\nC. Historical factors are secondary to moral imperatives.\nD. He has no answer.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThe ________ School of jurisprudence maintains that the law is shaped by logic.\nA. Historical\nB. Analytical\nC. Command\nD. Sociological\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nDworkin argues that it is only a conception of equality of resources that can secure the ideal of equality of welfare. How does he suggest this aspect of equality to be measured?\nA. When no-one would prefer another's bundle of resources to his or her own.\nB. By reference to the ownership of private property.\nC. By the amount of income tax paid by individuals.\nD. When the community determines that equality has been achieved.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich statement best describes the relationship between law and morality among non-positivist legal theorists?\nA. There is no relationship between law and morality.\nB. Law is always in advance of moral ideas.\nC. The law is inextricably bound up with morals.\nD. Morality is generally in advance of the law.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhy does communitarianism resemble Aristotle's philosophy more than Kant's?\nA. Because Aristotle justified slavery.\nB. Because Kant failed to distinguish individual from social morality?\nC. Because Aristotle believed that man is a 'social animal'\nD. Because Kant regarded the individual as unimportant.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich proposition below is the most inconsistent with a consequentialist justification of punishment?\nA. Punishment protects security.\nB. Punishment is a cost-effective method by which to prevent or reduce crime.\nC. Punishment protects personal safety.\nD. Punishment should fit the crime.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThe philosophers of the ________ School of jurisprudence believe that the law is a set of rules developed, communicated, and enforced by the ruling party rather than a reflection of the society's morality, history, logic, or sociology.\nA. Command\nB. Law and Economics\nC. Natural Law\nD. Critical Legal Studies\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich statement below best represents Durkheim's view of the function of punishment?\nA. Deterrence.\nB. Rehabilitation.\nC. Vengeance.\nD. Desert.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat does Dworkin mean by the 'semantic sting'?\nA. The language of the law is generally unclear.\nB. Lawyers' arguments usually concern language.\nC. Judges are prey to linguistic misunderstanding.\nD. The rule of recognition cannot fully account for legal validity.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThe expression to signify any assumption which conceals of affects to conceal the fact that a rule of law has undergone alteration, its letter being unchanged, its operation being modified is :\nA. Legal fiction\nB. Equity\nC. Custom\nD. Legislation\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nHume's attack on natural law is founded on his argument that:\nA. We cannot objectively know what is morally right or wrong.\nB. Natural law is backward-looking.\nC. There is no such thing as a social contract.\nD. Natural law fails to protect the state against attacks.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhy does Dworkin support liberal egalitarianism?\nA. Because it attempts to give effect to personal choice over individual luck.\nB. Because liberty is more important than equality.\nC. Because a market economy is just.\nD. Because the state is the best arbiter of equality between individuals.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhy do the Scandinavian realists reject a metaphysical approach to law?\nA. Because they regard empiricism as a more reliable method by which to understand the concept of law.\nB. Because they have no interest in the operation of the legal system.\nC. Because their approach is based on Bentham's sceptical account of the common law.\nD. Because they prefer a natural law analysis of legal ideas.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich statement below is the least consistent with the argument that judges in an unjust legal system ought to resign?\nA. Judges are under a duty to act justly.\nB. Since they also prop up the unjust system, lawyers should also resign.\nC. If a moral judge resigns, he or she may be replaced by a less moral judge.\nD. Judges do not make the law, hence they cannot be held responsible for applying unjust legislation.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nNormative legal theory is most accurately summarized by which of the following statements?\nA. Its principal concern is with moral or political values.\nB. It is represented by the positivist view of law as developed by HLA Hart.\nC. It expresses the idea that law consists only of norms.\nD. It is preoccupied with the analysis of the application of legislation to moral issues.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nHart writes: '[T]he certification of something as legally valid is not conclusive of the question of obedience ... however great the aura of majesty or authority which the official system may have, its demands must in the end be submitted to a moral scrutiny.' What does this say about the nature of legal positivism?\nA. That legal positivism is unconcerned about the morality of the law.\nB. That validly enacted law should always be obeyed.\nC. That moral issues fall outside the official legal system.\nD. That there is no moral duty to obey an unjust law.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following propositions would be rejected by those who describe themselves as critical legal theorists?\nA. Law is politics.\nB. Law is determinate.\nC. Law reflects economic power.\nD. Law is unstable.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nPosner denies the autonomy of law on two grounds. Name one of them.\nA. He denies that law develops independently of social and economic forces.\nB. He claims that law is economically immoral.\nC. He rejects a positivist account of law.\nD. He opposes any sociological analysis of the law.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nBill purchased a can of Sipep from the Ajax Minimart. After he finished drinking the Sipep, Bill noticed that the can contained dead insects stuck on the inside bottom of the can. In a strict product liability tort action against Ajax, Bill must prove, among other things, that:\nA. Ajax is a merchant selling Sipep.\nB. Ajax knew or should have known of the defective condition\nC. Ajax had prior notice of other similar problems with Sipep products.\nD. Ajax actually placed the dead insects into the can.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThe ________ School of jurisprudence believes that the law is an aggregate of social traditions and customs that have developed over the centuries.\nA. Historical\nB. Analytical\nC. Command\nD. Sociological\n\nResponse:\n"
    ],
    "obj_label": [
      "B",
      "B",
      "A",
      "C",
      "C",
      "D",
      "A",
      "C",
      "D",
      "A",
      "A",
      "A",
      "A",
      "D",
      "A",
      "D",
      "B",
      "A",
      "A",
      "A"
    ],
    "relation_name": "jurisprudence"
  },
  "88559b41-f96b-4ebc-accb-cc77e293954d": {
    "sentences": [
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nPoint out the most accurate response : According to Austin, law has the following attributes :\nA. Command, sovereign and enforceability\nB. Command, sovereign and legal remedy\nC. Command, sovereign and sanction\nD. Command, sovereign and obedience by subject\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich one of the following schools supports the view that a custom becomes law when it receives the stamp of judicial recognition by courts\nA. Analytical School\nB. Natural Law School\nC. Historical School\nD. Sociological School\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich statement is closest to characterizing the principal difference between the positions adopted by Hobbes and Locke?\nA. They adopt different attitudes towards the role of the courts in maintaining order.\nB. They disagree about the role of law in society.\nC. They have opposing views about the nature of contractual obligations.\nD. They differ in respect of their account of life before the social contract.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following statements best describes the postmodernist project?\nA. It attempts to demonstrate the relationship between law and literature.\nB. It seeks to defend Enlightenment values.\nC. It is preoccupied with the rise of bureaucratic government.\nD. It rejects the Kantian concern with individual rights, equality, and justice.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following best describes Lon Fuller's objective in his hypothetical case of the Speluncean Explorers?\nA. To demonstrate the differences between the criminal law and the civil law as they relate to cannibalism.\nB. To examine the central questions of legal and political philosophy.\nC. To criticize the role of the judiciary in cases involving a conflict between law and morality.\nD. To consider the extent to which murder requires mens rea.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following arguments against the 'fair play' argument in support of a duty to obey the law is the most persuasive?\nA. Fairness is a relative term.\nB. The legal system is, in fact, unfair.\nC. It sets a bad example.\nD. The law is irrational and ambiguous.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the main reason why many Critical Race Theorists are hostile to concepts such as 'justice', 'neutrality', and 'truth'?\nA. Because of their vagueness.\nB. Because they have failed to produce racial justice.\nC. Because they are unrelated to contemporary conditions.\nD. Because these ideas are alien to most people of colour.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nOn what grounds does John Finnis reject Hume's conception of practical reason?\nA. That natural law corresponds to positive law.\nB. That Hume is a legal positivist.\nC. That syllogistic logic is false.\nD. That human reason can help us to determine what constitutes a worthwhile life.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThe distinction between general and particular jurisprudence was recognized by\nA. Holland\nB. Salmond\nC. Austin\nD. Kelsen\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nLex iniusta non est lex' has which of the following meanings?\nA. The law is not valid unless it is formally enacted.\nB. Law has lexical priority over morality.\nC. An unjust law is not law.\nD. No-one is above the law.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIn which of the following the idea of ‘natural law’ first appeared\nA. French Revolution\nB. American War of Independence\nC. Roman Law\nD. Greek Thinking\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nTom and Jerry entered into a contract whereby Tom agreed to sell Jerry $1,000 worth of heroin, an illegal substance. This is an example of a:\nA. quasi contract\nB. void contract\nC. voidable contract\nD. secondary party beneficiary contract\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich statement best describes Tom Regan's 'sentimental anthropomorphicism' in support of animals rights?\nA. Animals have inherent worth which entitles them to the absolute right to live their lives with respect and autonomy.\nB. The social contract includes animals and their welfare.\nC. The suffering of a few animals may in principle be justified by the pleasure of or benefit to the many.\nD. Cruelty to animals is a reflection of the barbarity of a society.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThe following person is the author of the book ‘The Concept of Law’ :\nA. Hart\nB. Austin\nC. Bentham\nD. None of the above\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich description below most accurately captures the distinction between Gemeinschaft and Gesellschaft?\nA. Gemeinschaft is democratic Gesellschaft, autocratic.\nB. Gemeinschaft exists in civil society, Gesellschaft in civic society.\nC. Gemeinschaft is a society based on community, Gesellschaft one based on association\nD. Gemeinschaft refers to an open government, Gesellschaft to a lack of transparency.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThe judicial branch of the United States government has the power to ________ the law.\nA. interpret\nB. make\nC. enforce\nD. override\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\n“Natural law is based on the nature of man and on his inward need of living in society.” Who said it?\nA. Hugo Grotius\nB. Hobbes\nC. Locke\nD. Rousseau\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\n‘Law consists of set of principles or body of rules recognized and applied by the State in the administration of justice’. The statement is made by :\nA. Austin\nB. Salmond\nC. Holland\nD. Gray\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhy does the 'capability' approach to justice reject Rawls' theory?\nA. Because it fails to address the actual capabilities people have to benefit from his theory of justice.\nB. Because it ignores the duties of individuals.\nC. Because it applies only to democratic societies.\nD. Because it overlooks the importance of the courts.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following apparent correlatives contradicts Hohfeld's scheme of 'jural relations'?\nA. Right and duty.\nB. Privilege and no-right.\nC. Power and liability.\nD. Immunity and disability.\n\nResponse:\n"
    ],
    "obj_label": [
      "C",
      "A",
      "D",
      "D",
      "B",
      "B",
      "B",
      "D",
      "C",
      "C",
      "D",
      "B",
      "A",
      "A",
      "C",
      "A",
      "B",
      "B",
      "A",
      "C"
    ],
    "relation_name": "jurisprudence"
  },
  "ce55693e-6e6a-46fe-91a5-585e110965c7": {
    "sentences": [
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhy is it important to separate the concept of punishment from its justification?\nA. Because its justification depends on the concept employed.\nB. Because any definition of punishment should be value-neutral.\nC. Because the concept of punishment is controversial.\nD. Because the practice of punishment is separate from its justification.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nAccording to Hobbes, peace is the first law of nature because of which of the following situations?\nA. Without peace everyone has a right to everything - including another's life.\nB. Peace is possible only after war.\nC. Law cannot achieve peace.\nD. The social contract cannot be entered into unless there is peace.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThe United States Supreme Court's decision in Roe v Wade is highly controversial because:\nA. It failed to consider the rights of fathers.\nB. It overlooked the common law relating to abortion.\nC. The majority held that the abortion law of Texas was unconstitutional because it violated a woman's right to privacy.\nD. The court failed to consider the medical evidence.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThe focus of liberal feminists on equality is denounced by radical feminists as mistaken because:\nA. It treats women as objects.\nB. It makes women into men.\nC. It reduces feminism to a political movement.\nD. It overlooks the historical struggle of women for justice.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWho said that “Jurisprudence is the eye of law”\nA. Maine\nB. Savigny\nC. Pound\nD. Laski\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWho amongst the following said that jurisprudence is the philosophy of positive law\nA. Gray\nB. Holland\nC. Hart\nD. Austin\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nHart’s analysis of law distinguishes between\nA. Cause and effect\nB. Theory and fact\nC. Being obliged and having an obligation\nD. Corporeal and incorporeal rights\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWho defined jurisprudence as the knowledge of things divine and human, the science of right and wrong\nA. Austin\nB. Ulpian\nC. Holland\nD. Allen\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the factors below contributed significantly to the revival of natural law in the 20th century?\nA. The Depression of the 1930s.\nB. The rise of Fascism.\nC. The international recognition of human rights after WWII.\nD. The Bolshevik revolution.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThe U.S. Congress is empowered by the Commerce Clause and other provisions of the U.S. Constitution to enact ________ to regulate foreign and interstate commerce.\nA. ordinances\nB. federal statutes\nC. executive orders\nD. charters\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWho amongst the following said that “right with me is a child of law…..a natural right is a son that never had a father\"\nA. Jeremy Valdon\nB. Jeremy Bentham\nC. Salmond\nD. Paton\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nAmerican realists argued that formalism devalued the authority of the judge to make law, because:\nA. Judicial decisions are less important than legislation.\nB. Formalism treats legal reasoning as syllogistic reasoning.\nC. Judges generally base their decisions on formal logic.\nD. The structure of legal reasoning is flawed.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following most accurately describes Hart's response to Fuller's argument concerning the invalidity of Nazi law?\nA. The Nazi law in question was validly enacted.\nB. The court misunderstood the legislation.\nC. Fuller misconstrued the purpose of the law.\nD. The Nazi rule of recognition was unclear.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following is the strongest argument against ethical relativism's hostility to human rights?\nA. Utilitarianism\nB. Communitarianism.\nC. Cognitivism.\nD. Positivism.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nRobert Nozick's proposes the formula r x H as a guide to determine the appropriate punishment. What does it mean?\nA. Effectiveness of rehabilitation of multiplied by hazard to the community.\nB. Extent of responsibility multiplied by actual harm done.\nC. Risk of violence multiplied by degree of humility of offender.\nD. Recidivism multiplied by defendant's history.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWho says that “Social Contract is not a historical fact but a hypothetical construction of reason”\nA. Hobbes\nB. Locke\nC. Thomas Acquinas\nD. Rousseau\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThe legislative branch of the United States government has the power to ________ the law.\nA. interpret\nB. make\nC. enforce\nD. override\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nLeopold Pospisil identifies four elements manifested by law: authority, universality, 'obligatio' - and fourthly?\nA. Dispute.\nB. Sanction.\nC. Order.\nD. Hierarchy.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is Kant's 'categorical imperative?\nA. You must not consciously harm another person.\nB. You must always act in the best interests of the community.\nC. You must treat human beings as means rather than ends.\nD. You must act according as if your values apply to everyone.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following statements is correct concerning the \"reasonable person\" standard in tort law?\nA. The reasonable person standard varies from person to person.\nB. The reasonable person standard focuses on the defendant's subjective mental state rather than on the defendant's behavior\nC. A person with a physical disability must act as would a reasonable person with the same disability.\nD. A person with a mental disability must act as would a person with the same mental disability.\n\nResponse:\n"
    ],
    "obj_label": [
      "B",
      "A",
      "C",
      "B",
      "D",
      "D",
      "C",
      "B",
      "C",
      "B",
      "B",
      "B",
      "A",
      "C",
      "B",
      "D",
      "B",
      "B",
      "D",
      "C"
    ],
    "relation_name": "jurisprudence"
  },
  "5832bbea-d1b6-4783-b5d4-b2267d008d7e": {
    "sentences": [
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is the purpose of politics, according to Aristotle?\nA. To advance the interests of politicians.\nB. To produce virtuous citizens and encourage righteousness in individuals.\nC. To obtain power.\nD. To secure justice by abolishing slavery.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following statements most accurately explains Ross' comparison of social life to the game of chess?\nA. Chess is a game of skill; success in life is also a matter of skill.\nB. Winning a game of chess, like life, frequently depends on luck.\nC. In both games of chess and social life, there is effectively a dispute or contest.\nD. Social life is similar to chess because individual actions are often related to a common idea of rules.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich statement below is the least likely to follow logically from Savigny's notion of a Volksgeist?\nA. A society's law is a reflection of its culture.\nB. Law is like language.\nC. Law is the deliberate expression of a sovereign's will.\nD. Law is an integral element of the social fabric.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThe ________ School proposes that legal rules are unnecessary and are used as an obstacle by the powerful to maintain the status quo.\nA. Law and Economics\nB. Critical Legal Studies\nC. Historical\nD. Natural Law\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nAustin has been described as a 'naive empiricist.' Why?\nA. Because he neglects the importance of morality.\nB. Because his account of law is based on an anachronistic model of a legal system.\nC. Because he conceives of laws in a pragmatic rather than a conceptual manner.\nD. Because he overlooks the role of law in economic relations.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich one of the following doctrines is not associated with Natural Law thinking\nA. Doctrine of substituted security\nB. Doctrine of due process\nC. Doctrine of bias\nD. Doctrine of reasonableness\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich proposition below is the most powerful refutation of Olivecrona's psychological explanation of law?\nA. Coercion plays no part in our decision to obey the law.\nB. He provides no empirical evidence in support of his thesis.\nC. His argument is itself metaphysical.\nD. He neglects the relation between morality and legal duty.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nSoft positivism accepts that the rule of recognition may include moral criteria.'\nWhich proposition below is the most inconsistent with this description?\nA. Incorporationism' accepts that judges may decide cases by reference to moral factors.'\nB. A soft positivist rejects the role of morality in the description of law.\nC. Sometimes the definition of law includes moral considerations.\nD. Judges lack strong discretion.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhy is there an increasing recognition that retribution is a fundamental element of punishment?\nA. Because rehabilitation of offenders presumes a recognition of the role of vengeance.\nB. Because the lex talionis is misguided.\nC. Because other justifications appear to have failed.\nD. Because revenge is anachronistic.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWho was the first jurist to study comparative aspect of law?\nA. Savigny\nB. Austin\nC. Kelsen\nD. Maine\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich proposition below can be characterized as the most powerful refutation of Bentham's argument in support of codification?\nA. The law is too complex to be codified.\nB. Codification ossifies the law.\nC. Bentham fails to take account of the criminal law.\nD. Significant portions of the law are already codified.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nPosner's economic analysis of law is roundly attacked by Dworkin who says the theory 'has not achieved the beginning of a beginning.' What is the basis of this criticism?\nA. Posner's approach fails to offer a means by which to calculate individual prosperity.\nB. It neglects the importance of individual choice.\nC. It regards wealth as a value, which it is not.\nD. The theory is economically unsound.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is meant by 'asking the women question'?\nA. Encouraging women to be more assertive.\nB. Enquiring of men why they oppress women.\nC. Seeking answers from women about their experience of discrimination.\nD. Attempting to expose the gender consequence of rules and practices that may seem to be objective or neutral.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhy is Bentham's account of sovereignty generally considered to be more sophisticated - and more acceptable - than Austin's?\nA. Because Bentham's Utilitarianism redeems his account of sovereignty.\nB. Because Austin overlooks the significance of morality.\nC. Because Bentham recognizes the possibility of limiting the sovereign's power.\nD. Because Austin incorporates power-conferring rules into his concept of the sovereign's commands.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nState legislatures often delegate lawmaking authority to local government bodies, including cities and municipalities, counties, school districts, water districts, and such. These governmental units are empowered to adopt ________.\nA. ordinances\nB. executive orders\nC. federal statutes\nD. charters\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThe Marxist and critical race theory notions espoused by CRT are diametrically opposed to our democratic ideals.'\nWhich statement below is the most powerful refutation of this view?\nA. There are no traces of left wing thought among CRT scholars.\nB. Some CRT writing is openly sceptical of traditional American values.\nC. Democracy is not an uncomplicated concept.\nD. This is an unjustifiably narrow view of the CRT agenda.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich position does Rawls claim is the least likely to be adopted by the POP (people in the original position)?\nA. The POP would choose equality above liberty.\nB. The POP would opt for the 'maximin' strategy.\nC. The POP would opt for the 'difference principle'.\nD. The POP would reject the 'system of natural liberty.'\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nFunctions of the law include all but which of the following?\nA. maximizing individual freedom\nB. providing a basis for compromise\nC. keeping the peace\nD. promoting the principles of the free enterprise system\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich word best summarizes Weber's explanation of the development of formally rational law?\nA. Authority.\nB. Charisma.\nC. Co-operation.\nD. Capitalism.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThe ________ School of jurisprudence postulates that the law is based on what is \"correct.\"\nA. Natural Law\nB. Analytical\nC. Historical\nD. Sociological\n\nResponse:\n"
    ],
    "obj_label": [
      "B",
      "D",
      "C",
      "B",
      "C",
      "A",
      "B",
      "D",
      "C",
      "D",
      "A",
      "C",
      "D",
      "C",
      "A",
      "D",
      "A",
      "D",
      "D",
      "A"
    ],
    "relation_name": "jurisprudence"
  },
  "ee98c592-9bde-44e8-b1b4-1631b6f7874b": {
    "sentences": [
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIverson Jewelers wrote a letter to Miller, 'We have received an exceptionally fine self winding Rolox watch which we will sell to you at a very favorable price.'\nA. The letter is an offer to sell\nB. A valid offer cannot be made by letter.\nC. The letter contains a valid offer which will terminate within a reasonable time.\nD. The letter lacks one of the essential elements of an offer.\n\nResponse:\n"
    ],
    "obj_label": [
      "D"
    ],
    "relation_name": "jurisprudence"
  },
  "775ca2ad-8cba-402b-b39f-c82e0538c65f": {
    "sentences": [
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThe accused made a confession to the police, but his defense attorney needs to find out if the confession is admissible. In which of the following situations would a confession be inadmissible?\nA. The defendant's statement was involuntary.\nB. The defendant's statement was voluntary.\nC. The defendant was not in custody when the statement was made.\nD. The statement was not made in response to a known police interrogation.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following is not a warrantless search exception?\nA. Cold pursuit\nB. Incident to a lawful arrest\nC. Plain view\nD. Stop and frisk\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA man conveys to his wife's cousin a property to \"cousin and the heirs of his body.\" He then conveys the same property to his niece in fee simple. Under modern real estate laws and practice in most states today, what interest if any does his niece have?\nA. The conveyance gives the niece nothing because the property was already conveyed in fee simple to his wife's cousin.\nB. She gets a reversion in case the cousin has no heir of his body at his death.\nC. A contingent remainder based upon whether or not cousin has heirs.\nD. She has a fee simple.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA manufacturer created a new brand of fish tackle which they sold throughout the country. Congress now imposes a tax of 14 cents on each set of tackle sold in the United States. This tax is\nA. unconstitutional, because the tackle is sold in interstate commerce.\nB. unconstitutional, because it interferes with the sovereign right of state governments to engage in intrastate commerce.\nC. constitutional, because the supremacy clause validates laws enacted by Congress.\nD. constitutional, because it is within the power of Congress to raise revenue.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIf certain fundamental rights are denied to some individuals but not others, then it is considered what type of problem?\nA. Substantive due process problem\nB. Equal protection problem\nC. Procedural due process problem\nD. None of these\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA local ordinance in Breezytown allows the mayor to decide who may get a permit to speak in the city park. The ordinance is broad, stating only that the mayor can use his discretion in granting permits. If someone just extemporaneously gives a political speech in the park without a permit and were arrested and convicted, would this be constitutional?\nA. Yes, because the ordinance controls.\nB. Yes, because he didn't have a permit.\nC. No, the ordinance is void on its face.\nD. No, because it is a public park.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIn which of the following stages does an indigent person not have the Sixth Amendment right to counsel?\nA. Preliminary Hearing\nB. Arraignment\nC. investigative surveillance\nD. Post-charge lineups\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nCongress recently enacted a statute that prohibits racial discrimination in the sale, transfer, or rental of real estate, either privately or publicly. Which of the following constitutional provisions would provide the best rationale for the enactment of this federal statute?\nA. Under Article I, Congress has the power to enact laws that are \"necessary and proper\" to the general welfare.\nB. The enforcement provision of Section 2 of the Thirteenth Amendment.\nC. The enforcement provision of Section 5 of the Fourteenth Amendment.\nD. The due process clause of the Fifth Amendment.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nAnderson and Parker decide to form a corporation which will locate missing children. Which of the following would be a proper name for the corporation?\nA. ANDERSON\nB. FBI Consultants, Incorporated\nC. Private Eye Partners\nD. Child Finder Company\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThe president, vice-president, and U.S. civil officers can be impeached. Which of the following is not true about impeachment?\nA. Grounds include treason and bribery\nB. Grounds include high crimes and misdemeanors\nC. A majority vote in the House is necessary to invoke charges of impeachment\nD. A three-fourths vote in the Senate is necessary to convict and remove from office\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA victim was leaving his favorite local watering hole and contemplating a late night cheeseburger when he tripped over his own feet and fell on the sidewalk. A few moments later, the victim got up in a daze and stepped into the street, where he was struck by a car driven by the defendant, who was speeding, in violation of a regulation of state law. The victim died in the hospital two hours later. Which of the following is the most serious crime for which the defendant should be found guilty?\nA. Speeding.\nB. Involuntary manslaughter.\nC. Voluntary manslaughter.\nD. Murder.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA plaintiff sued an insurance company to recover life insurance proceeds. At trial, the issue before the court is the insured's correct date of birth. Which of the following is inadmissible if offered to prove the insured's correct date of birth?\nA. A family portrait engraved with the ages of the family members.\nB. A family bible with the insured's birth date inscribed on the cover.\nC. A photocopy of the insured's birth certificate.\nD. A sworn affidavit from the insured's brother verifying the insured's birth date.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nArrests may occasionally be made without a warrant. Which of the following is not one of those circumstances?\nA. A misdemeanor has occurred, and an officer must believe that the person he has arrested committed it.\nB. An officer must have probable cause that a felony has occurred and that the arrested person committed it.\nC. An officer may arrest for a felony committed in his presence.\nD. An officer may arrest for a misdemeanor that is a breach of peace and committed in arresting party's presence.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following is false about ex post facto laws?\nA. They make criminal an act that was innocent when committed.\nB. They prescribe greater punishment for an act than was prescribed when it was done.\nC. They increase the evidence required to convict a person than when the act was done.\nD. They alter criminal offenses or punishment in a substantially prejudicial manner for the purpose of punishing a person for some past activity.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA federal agent wants to obtain a court order for a wiretap. Which of the following is not required to be set forth in the agent's affidavit submitted to the court for an order authorizing the wiretap?\nA. That the wiretap will extend indefinitely until all relevant conversations are recorded.\nB. Details on the nature of the offense that has been, is being or will be committed.\nC. A particular description of the type of communications sought to be intercepted.\nD. Identification of the persons to be overheard must be given, if known.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nOwner has a property in fee simple absolute. He executes a deed to Friend with the words \"To Friend for life and then to the heirs of Owner.\" Under common law principles the conveyance to the heirs is not effective. Thus, the deed would result in a life estate to Friend with a reversion back to Owner. That result is due to what common law doctrine?\nA. The rule in Shelly's case\nB. The doctrine of concurrent ownership\nC. The doctrine of worthier title\nD. The rule against perpetuities\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThere is a voting law that is going to be reviewed by the court. If the law is upheld, what must be true?\nA. The law is necessary to achieve a compelling government purpose.\nB. The law is substantially related to an important government purpose.\nC. The law is rationally related to a legitimate government purpose.\nD. The law is substantially related to a legitimate government purpose.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following is not an element of common law burglary?\nA. A breaking and entry\nB. Of a dwelling, of another\nC. During the daytime\nD. With the intent to commit a felony therein.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIn which of the following situations does the best evidence rule generally not apply?\nA. Collateral matters\nB. Public records\nC. When it's not offered to prove the contents of the document\nD. All of the above.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nAn investor sued a corporation for stock fraud. In presenting his case-in-chief, the investor sought to introduce an issue of a newspaper to show the corporation's stock price on that given day. Upon objection by the corporation's attorney, this evidence should be\nA. admitted, under the business records exception.\nB. admitted, under the market reports exception.\nC. excluded, because the newspaper copy does not fit within any established exception to the hearsay rule.\nD. excluded, because it violates the best evidence rule.\n\nResponse:\n"
    ],
    "obj_label": [
      "A",
      "A",
      "A",
      "D",
      "B",
      "C",
      "C",
      "B",
      "D",
      "D",
      "B",
      "D",
      "A",
      "C",
      "A",
      "C",
      "A",
      "C",
      "D",
      "B"
    ],
    "relation_name": "professional_law"
  },
  "5823758b-6279-4ea1-8a0c-ca3299cfd1af": {
    "sentences": [
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich is the hierarchy of U.S. Law?\nA. Executive agreements, U.S. Constitution, treaties and federal statutes, state law\nB. U.S constitution, treaties and federal statutes, executive agreements, state law\nC. Treaties and federal statutes, US Constitution, executive agreements, state law\nD. U.S constitution, executive agreements, treaties and federal statutes, state law\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is it called when a remainder in the grantor's heirs is invalid and becomes a reversion in the grantor?\nA. Rule in Shelley's Case\nB. Related Doctrine of Merger\nC. Contingent remainder\nD. Doctrine of Worthier Title\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA defendant gave a man a gun and instructed him to kill a victim. The man shot and killed the victim with the gun. The man was charged with murder and acquitted. The defendant is now charged with the murder of the victim. He will be able to assert a valid defense if the man's acquittal was based on which of the following?\nA. Insanity.\nB. Self-defense.\nC. Diminished capacity.\nD. The Wharton Rule.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWith the intent to commit a felony therein.\nA. Contingent remainders\nB. Executory interests\nC. Vested remainders subject to open\nD. Reversions\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following constitutional provisions is applicable to corporations?\nA. The privileges and immunities clause of the Fourteenth Amendment.\nB. The comity clause of Article IV.\nC. The Fifth Amendment's prohibition against compulsory self-incrimination.\nD. The equal protection clause of the Fourteenth Amendment.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nDuring a run one morning, a jogger passed a convenience store. He stopped and went into the store to use the bathroom available inside the store. Which of the following would best describe the jogger's legal status in his utilization of the bathroom?\nA. Licensee.\nB. Gratuitous licensee.\nC. Public invitee.\nD. Business visitor.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nAn auto mechanic was repairing a car in his auto. shop when a spark ignited gasoline and oil residue on the floor. The mechanic managed to douse the flames, but not before the fire created giant billows of smoke that floated over onto a neighbor's property and caused the neighbor's home to become discolored. If the neighbor asserts a claim against the mechanic, the neighbor would most likely be able to recover for\nA. strict liability.\nB. negligence.\nC. nuisance.\nD. trespass.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nBefore a federal court may address a case, it has to be justiciable, i.e., involve a case or controversy. Which of the following is not an additional limitation on federal court jurisdiction?\nA. It has to result in an advisory opinion\nB. The issue has to be ripe\nC. The issue can't be moot\nD. A person must have a concrete stake in the outcome.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nBuyer purchases an item from a merchant that turns out to be unfit, defective and unsafe for its ordinary purposes. Assuming no other warranties, which of the following can be invoked by the buyer?\nA. Express warranty\nB. Implied warranty\nC. Warranty of title\nD. Warranty of merchantability\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nUnder common law principles, which of the following is not correct regarding the duty owed by a possessor of land towards an undiscovered trespasser?\nA. No duty for artificial conditions.\nB. A duty for natural conditions.\nC. No duty for natural conditions.\nD. No duty for active operations.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following powers standing alone cannot support federal law?\nA. taxing power\nB. spending power\nC. necessary and proper power\nD. commerce power\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nClient thinks she has been slandered. What of the following is not true about slander?\nA. It is spoken defamation.\nB. Plaintiff has to prove special damages, unless it falls into slander per se.\nC. The statement does not have to be published if it constitutes slander per se.\nD. There are four slander per se categories.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nFernandez is planning to attend an auction of the assets of Cross & Black, one of his major competitors who is liquidating. In the conduct of the auction, which of the following rules applies?\nA. Such a sale is without reserve unless the goods are explicitly put up with reserve.\nB. A bidder may retract his bid at any time until the falling of the hammer.\nC. The retraction of a bid by a bidder revives the previous bid.\nD. If the auction is without reserve, the auctioneer can withdraw the article at any time prior to the fall of the hammer.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA criminal actor committed the crime of solicitation. Which of the following does not apply to solicitation?\nA. It is an agreement between two or more to commit a crime.\nB. It is solicitation of another to commit a felony.\nC. No act is needed other than the solicitation.\nD. Withdrawal is generally not a defense.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIf a regulation does amount to a taking, then what must the government do?\nA. Pay just compensation for the property\nB. Terminate the regulation and pay damages that occurred while regulation was in effect\nC. Pay double damages if not addressed in 30 days.\nD. a or b\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nAs part of his defense to a murder charge, a defendant offered testimony that he was committing a bank robbery in another state on the day that the victim was killed. The testimony is\nA. admissible as not hearsay.\nB. admissible as an admission.\nC. admissible as a declaration against interest.\nD. admissible as then-existing state of mind.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThe most likely contract to be classified under the Uniform Commercial Code (UCC) is a contract for\nA. A common carrier delivering a new computer.\nB. Crops and timber to be severed from the property next summer.\nC. The purchase of a commercial property building.\nD. The sale of an intangible asset.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA merchant's irrevocable written offer (firm offer) to sell goods\nA. Must be separately signed if the offeree supplies a form contract containing the offer.\nB. Is valid for three months.\nC. Is nonassignable.\nD. Can not exceed a three-month duration even if consideration is given.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nOne morning in a Laundromat, a defendant approached a man and said, \"If you don't pay me $500 by July 2, I'll beat you to a pulp. \" A week later, on July 2, the defendant met the man at a local bar and demanded the money. The man handed the defendant the $500. After receiving the money, the defendant then punched the man in the stomach and hurriedly left the bar. Under modem statutory law, the defendant will most likely be found guilty of which of the following crimes?\nA. Extortion and battery.\nB. Extortion and robbery.\nC. Assault and battery.\nD. Assault and robbery.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nOn January 1, an employee is hired to work for an employer for one year at a weekly salary of $500. After six months the employee is fired. In determining what rights the employee has against the employer, the agreement between the employer and the employee may best be interpreted as\nA. an entire contract.\nB. a divisible contract.\nC. an installment contract.\nD. neither divisible nor entire.\n\nResponse:\n"
    ],
    "obj_label": [
      "B",
      "D",
      "B",
      "D",
      "D",
      "C",
      "B",
      "A",
      "D",
      "B",
      "C",
      "C",
      "B",
      "A",
      "D",
      "A",
      "B",
      "A",
      "A",
      "B"
    ],
    "relation_name": "professional_law"
  },
  "defbe318-f808-4b69-8567-80e22fb55dd7": {
    "sentences": [
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhile dining together one night in a crowded restaurant, Billy-Joe confesses to his wife Bobbie-Sue, \"Before we were married, I shot a man while robbing his castle.\" Police detective Larry Lawman overhears the conversation and arrests Billy-Joe. At Billy-Joe's murder trial, Bobbie-Sue is called by the prosecution and asked about Billy-Joe's statement. Which objection will the judge be most likely to sustain?\nA. Hearsay.\nB. Marital Communication Privilege.\nC. Specific instances of conduct cannot be proved by extrinsic evidence.\nD. None, because the statement is admissible.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIf there is a conflict between a congressional act and a valid treaty, how is it resolved?\nA. The congressional act always prevails\nB. The valid treaty always prevails\nC. The last in time prevails\nD. The president decides\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA sister and brother own a ranch as joint tenants. If the sister transfers her interest by quitclaim deed to her friend without the brother's knowledge, what interest, if any, does the friend have in the ranch?\nA. No interest.\nB. An undivided one-half interest with right of survivorship.\nC. An undivided one-half interest without right of survivorship.\nD. A lien against the entire property.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nJustin's estate sues Polly for wrongful death. The estate calls Officer Friendly as a witness who interviewed Polly right after the event. Officer will testify that Polly said, \"Oops, I was cleaning my pistol and it went off and shot Justin. I sure was negligent!\" Is Officer's testimony admissible?\nA. Yes, statement against interest.\nB. No, hearsay without an exception.\nC. Yes, admission by party.\nD. No, opinion on an ultimate issue that must be left for the jury.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nGeorge was charged with the murder of a well- known criminal. The victim was found shot to death in his car. The only witness to the shooting was the victim's pet parrot, which was found hovering over the victim's body repeating over and over, \"George don't. . . George don't. \"To prove the identity of the victim's killer, the prosecution has a witness testify that about the time of the murder, he was in the area and heard the victim's parrot calling George's name. The best objection to the testimony is that it is\nA. hearsay.\nB. irrelevant.\nC. opinion testimony.\nD. self-serving.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nBuyer is purchasing a bicycle based on the salesperson's understanding of buyer's goals and seller's knowledge. What kind of warranty might this be considered?\nA. Warranty of Fitness for Particular Purpose.\nB. Warranty of Merchantability\nC. Express\nD. Implied\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA used car dealer needs to disclaim any implied warranty of merchantability. Which of the following is not considered an effective way of making a full disclaimer of the implied warranty?\nA. By stating in the contract that there is no \"implied warranty of merchantability.\nB. By stating in writing that the vehicle is sold \"as is.\"\nC. By setting forth an express disclaimer that is clear, on the point, and conspicuous.\nD. By limiting the amount to the value of the vehicle sold.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA husband came home early from work one day. He walked to the bedroom and, upon opening the door, saw his wife and another man in bed together. Visibly upset, the husband told the other man to leave. As the man was reaching for his pants, he pulled out a gun, fearing that the husband was about to attack him. When the husband saw the gun, he jumped on the man and angrily twisted his neck, breaking it and killing him. The husband is guilty for which, if any, of the following crimes?\nA. Murder.\nB. Voluntary manslaughter.\nC. Involuntary manslaughter.\nD. No crime.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nRegarding a deposition in a civil suit, which of the following is/are true? I. A deposition of a person against whom another person contemplates filing an action may be compelled by the party contemplating the action, without leave of court, before the action is filed. II. A deposition of the defendant in an action may be taken by the plaintiff without service of a subpoena on the defendant. III. A deposition may be taken even though all the testimony secured by it will be inadmissible at the trial.\nA. II only.\nB. I and II only.\nC. II and III only.\nD. I, II, and III.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat kind of damages put the nonbreaching party into as good a position as if the other party had fully performed?\nA. Nominal\nB. Punitive\nC. Rescission\nD. Compensatory\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nSeller has a contract that specifies a delivery point. What kind of a contract is this?\nA. F.A.S. Contract\nB. Destination contract\nC. Shipment contract\nD. F.O.B. Contract\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA new gang member, hoping to impress the gang's leader, pointed a gun at a pedestrian and ordered her to give him her expensive watch, which she did. The gang member then tossed the watch to the gang leader, who was standing nearby. Although totally surprised by this act, the gang leader put the watch in his pocket. The pedestrian ran away. What crime did the gang leader commit?\nA. Accessory after the fact to robbery.\nB. Accomplice to robbery.\nC. Conspiracy to commit robbery.\nD. Receiving stolen property.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nCongress enacts a $100 tax on the sale of any handgun to a private individual not for use in law enforcement or military duties. Will this new handgun tax survive a constitutional challenge?\nA. Yes, if Congress could have banned possession of handguns outright.\nB. Yes, if the dominant intent of Congress was that the tax would produce revenue.\nC. No, if the tax does not result in a significant collection of revenue.\nD. No, because the tax is clearly intended as a penalty on handgun ownership.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following is not a correct form of real evidence?\nA. Weapons or implements\nB. marks, scars, wounds\nC. Photographs\nD. Hearsay\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nJack and Jill began to negotiate for the transfer of a business. Their negotiations continued for some time. J ack is asserting that Jill made an offer and promise which he accepted with a return promise. Jill asserts that the agreement was not what she intended. In determining whether a contract has been created, the courts look primarily at\nA. The fairness to the parties.\nB. The objective intent of the parties.\nC. The subjective intent of the parties.\nD. The subjective intent of the offeror.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following will not terminate a contract by operation of law?\nA. Death or insanity of a party.\nB. Partial performance\nC. Destruction of the subject matter of contract.\nD. Supervening illegality\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nCalvin Poultry Co. offered to sell Chickenshop 20,000 pounds of chicken at 40 cents per pound under specified delivery terms. Chickenshop accepted the offer as follows: \"We accept your offer for 20,000 pounds of chicken at 40 cents per pound per city scale weight certificate.\"\u009d Which of the following is correct?\nA. A contract was formed on Calvin's terms.\nB. Chickenshop's reply constitutes a conditional acceptance, but not a counteroffer.\nC. Chickenshop's reply constitutes a counteroffer and no contract was formed.\nD. A contract was formed on Chickenshop's terms.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA defendant charged with first-degree murder shall be furnished with a list containing names and addresses of all prospective jurors\nA. upon court order.\nB. upon request.\nC. upon request and showing of good cause.\nD. under no circumstances.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA ski resort had a lift that carried customers from the bottom to the top of the ski slope. One afternoon, the lift suddenly broke down because of a power failure in the area. A customer was suspended in his lift chair, one-third of the way up the hill and 50 feet above the ground. The customer remained on the lift for five hours until power was restored. He was then returned uninjured to the bottom of the hill. In a suit against the ski resort, the customer is likely to have action for\nA. false imprisonment.\nB. negligence.\nC. assault.\nD. no cause of action.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following is not within the power of a federal subpoena to command a person to do at a specified time and place?\nA. Submit to a physical or mental examination.\nB. Attend and testify as to persons and/or events related to a cause of action.\nC. Produce designated documents, electronically stored information, or tangible things in that person's possession, custody, or control.\nD. Permit the inspection of premises.\n\nResponse:\n"
    ],
    "obj_label": [
      "D",
      "C",
      "C",
      "C",
      "B",
      "A",
      "D",
      "D",
      "C",
      "D",
      "D",
      "C",
      "B",
      "D",
      "B",
      "B",
      "D",
      "B",
      "D",
      "A"
    ],
    "relation_name": "professional_law"
  },
  "7eac67af-f160-455e-b41c-9dccbbddc685": {
    "sentences": [
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA witness is scheduled to testify in a criminal case. To prove that he was a juvenile on a given date, evidence is offered that on that date he was confined in a juvenile detention facility. If a party wished to argue that this evidence is hearsay, whom would he point to as the hearsay declarant?\nA. The witness on the stand.\nB. The party offering the evidence.\nC. The juvenile authorities.\nD. The witness.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThe Supreme Court has original jurisdiction in certain areas. Congress has given lower federal courts concurrent jurisdiction with the Supreme Court in all cases except for disputes involving:\nA. ambassadors\nB. public ministers and consuls\nC. different states\nD. a state as a party\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA defendant was charged with felony murder as a result of his setting fire to the victim's house. The victim was upstairs sleeping when the fire was set, and he died in his bedroom during the fire. If the defendant can prove the facts to support his defense, which of the following assertions would LEAST likely remove liability for felony murder?\nA. The defendant did not intend to kill the victim.\nB. The defendant was insane when he set the fire.\nC. The defendant was coerced by another to set the fire.\nD. The victim died of a heart attack before the fire spread to his bedroom.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nTermination of a parent's custody rights and also termination of welfare benefits both require what type of process?\nA. Prior notice and prior evidentiary hearing\nB. Prior notice and opportunity to respond\nC. Prior screening by neutral fact finder\nD. Prior screening and subsequent evidentiary hearing\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThere is a grand jury proceeding underway for a local businessman. What is not true about grand jury proceedings?\nA. The proceedings are conducted in secret.\nB. There is no right to counsel.\nC. There is a right to Miranda warnings.\nD. There is no right to have evidence excluded.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich statement best describes the profit sharing relationship of a general partnership where the partners have agreed only on voting percentage and the voting shares are unequal?\nA. Partners share in proportion to their contributions to the capital and assets of the partnership.\nB. Partners share in proportion to their voting percentage.\nC. Partners share equally.\nD. Partners cannot share until they unanimously agree upon a distribution.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA driver drove his car into the full-service area ofa gas station. He told the attendant, \"Ten gallons,please. \" The attendant went ahead and pumped10 gallons of gas into the driver's tank. When theattendant approached the driver for payment, thedriver drove off without paying. The driver is guilty of\nA. larceny.\nB. larceny by trick.\nC. false pretenses.\nD. embezzlement.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIn which instance would a state, under the enabling clause of the Fourteenth Amendment, be most able to regulate?\nA. A private individual from discriminating against a person based on race.\nB. A private individual from discriminating against a person based on nationality.\nC. A state official from discriminating against a person based on race.\nD. A federal official from discriminating against a person based on nationality.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhere a client accepts the services of an attorney without an agreement concerning the amount of the fee, there is\nA. An implied-in-fact contract.\nB. An implied-in-law contract.\nC. An express contract.\nD. No contract.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIn a suit by an investor against a speculator, a relevant fact is the price of gold as quoted on a specific date 20 years ago. The investor calls a librarian to authenticate the microfilm copy of a newspaper from that date. This copy, kept in the archives of the public library, is the only record of that particular issue of the newspaper. The microfilm is\nA. admissible, to prove the price of gold on that day.\nB. admissible as an ancient document.\nC. admissible as past recollection recorded.\nD. inadmissible as not the best evidence.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIn order to establish the unavailability of a witness at trial\nA. it is sufficient to show that the witness is not presently in court.\nB. it is necessary to show that he has died.\nC. it is necessary to show that every reasonable effort has been made to procure his attendance.\nD. if living, it is necessary to show that he is insane.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nTo prove a discriminatory classification, it must be shown that the government had intent to discriminate. Such intent can be shown by all but which of the following?\nA. A law that is discriminatory on its face.\nB. A discriminatory application of a facially neutral law.\nC. A discriminatory effect.\nD. A discriminatory motive.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThird-year student is studying contracts. He has learned that generally all contractual rights may be assigned, but there are some exceptions. Which of the following is not an exception?\nA. An assignment that continues the obligor's duty or risk.\nB. An assignment not allowed by law.\nC. An assignment of future rights from future contracts.\nD. An assignment that substantially changes obligor's duty or risk.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA man is charged with murder. During the trial, defense counsel offers the testimony of a man on death row admitting he hired another man to shoot the victim. The testimony is\nA. not hearsay.\nB. hearsay, but admissible as an admission.\nC. hearsay, but admissible as a dying declaration.\nD. hearsay not within any recognized exception.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA man drinks a great deal of punch at a party. He was unaware that it contained PCP. Later in the evening, in an uncontrollable psychotic rage brought on by the drugs he kills someone at the party. The prosecution asks for second degree murder. What defense would have the best chance to succeed under the circumstances?\nA. Voluntary intoxication\nB. Irresistible Impulse\nC. Involuntary intoxication\nD. Ignorance or Mistake\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nSeller says a circumstance has occurred that makes performing a sales contract impractical. Which of the following is not correct about discharge for impracticability?\nA. The problem must not have been caused by the fault of the party seeking to invoke the defense.\nB. A price increase is sufficient for discharge.\nC. The failure to excuse performance would result in grave injustice.\nD. The impracticality must go to a basic assumption on which the contract was made.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA widget manufacturer and a widget retailer signed the following agreement:\"The manufacturer promises to sell and the retailer promises to buy 10,000 widgets at $50 per 100. One thousand widgets are to be delivered by the manufacturer on the first day of each of the next 10 months. EACH MONTHLY DELIVERY ISA SEPARATE CONTRACT. Payment to be made within 10 days of receipt of each shipment. \"The agreement between the manufacturer and the retailer may best be interpreted as\nA. a divisible contract.\nB. an installment contract.\nC. 10 separate contracts.\nD. a requirements-output contract.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nBase Electric Co. has entered an agreement to buy its actual requirements of copper wiring for six months from the Seymour Metal Wire Company and Seymour Metal has agreed to sell all the copper wiring Base will require for six months. The agreement between the two companies is\nA. Unenforceable because it is too indefinite as to quantity.\nB. Unenforceable because it lacks mutuality of obligation.\nC. Unenforceable because of lack of consideration.\nD. Valid and enforceable.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA buyer contracted to purchase a used car from a seller for $10000. On the date the sale was to take place, the buyer tendered a $10,000 cashier's check to the seller. The seller rejected the tender and refused to deliver the car to the buyer. If the buyer brings an action for breach of contract against the seller, the buyer is entitled to which of the following remedies?\nA. Damages measured by the difference between the market price and the contract price for the car.\nB. Recovery of the contract price of the car.\nC. Specific performance.\nD. Recovery of the market price of the car.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nCongress enacted a statute wherein the government would purchase and operate all of the nation's airlines. In all likelihood, Congress's power to enact this legislation will derive from\nA. its power to tax and provide for the general welfare.\nB. its power to raise and support an army and declare war.\nC. its power to regulate commerce.\nD. its power to make laws regarding territory and other property belonging to the United States.\n\nResponse:\n"
    ],
    "obj_label": [
      "C",
      "C",
      "A",
      "A",
      "C",
      "C",
      "B",
      "C",
      "A",
      "A",
      "C",
      "C",
      "A",
      "A",
      "C",
      "B",
      "B",
      "D",
      "A",
      "C"
    ],
    "relation_name": "professional_law"
  },
  "d424b22e-7218-482e-97cc-2fbd2dbd5dbf": {
    "sentences": [
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThe President may appoint which of the following with the advice and consent of the Senate?\nA. Ambassadors\nB. public ministers and consuls\nC. justices of the Supreme Court\nD. all of the above\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following types of regulations would not be reviewed under the strict scrutiny standard of review?\nA. Gender\nB. Interstate travel\nC. Privacy\nD. Alienage\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWendy Wholesaler sold merchandise to Roberta Retailer. A dispute has arisen between the parties and Roberta is trying to prove that Wendy is a \u0089ÛÏmerchant\u0089Û\u009d as opposed to a \"casual party.\" The least important factor indicating the status of a \"merchant\" is that Wendy\nA. Is a wholesaler rather than a retailer.\nB. Deals in the goods sold to Roberta.\nC. Holds herself out as an expert in the goods sold to Roberta.\nD. Sells under 10 units a year to Roberta.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nNeighbor says his home repair contract needs to be discharged because of frustration of purpose. Which of the following is not required for this to be discharged for this reason?\nA. A supervening event.\nB. That was reasonably foreseeable at time of contract formation.\nC. Which completely or almost completely destroys the purpose of the contract.\nD. The purpose of the contract was understood by both parties.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA defendant entered a bar and ordered a beer. The bartender politely told the defendant he would have to wait until two other patrons were served. The defendant became irate and pulled out a small penknife. Although the defendant intended only to frighten the bartender, he accidentally nicked the bartender's arm with the penknife. The bartender's arm became infected, and he died from gangrene two months later. The most serious crime that the defendant can be convicted of is\nA. battery.\nB. involuntary manslaughter.\nC. assault with a deadly weapon.\nD. murder.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA homeowner conveyed his property to his cousin \"for life, with remainder to (the homeowner's) heirs. \" Later, the cousin conveyed the property to a farmer \"for as long as he would continue to farm the property. \" After the cousin's death, the homeowner's heirs brought suit against the farmer to quiet title. Which common law doctrine would be most applicable in the court's determination of the ownership of the property?\nA. Rule in Wild's Case.\nB. Doctrine of Destructibility of Contingent Remainders.\nC. Doctrine of Worthier Title.\nD. Rule against Remainders in the Grantees' Heirs.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA man was at a pub drinking beer and playing darts with a group of friends. Quite intoxicated, the man left the bar around midnight. He was staggering down the street when the defendant approached him from behind. The defendant took out a stick, stuck it against the man's back and told the man to give him his wallet or he was going to shoot him. Frightened, the man fainted and fell to the pavement. The defendant reached into the man's pants pocket and stole his wallet. The defendant is guilty of\nA. attempted robbery.\nB. robbery.\nC. larceny.\nD. assault and larceny.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA wife and husband are married and own a dairy as tenants by the entirety. If the wife transfers her interest in the dairy by quitclaim deed to her aunt without the husband's knowledge, what interest, if any, does the aunt have?\nA. No interest.\nB. An undivided one-half interest with right of survivorship.\nC. An undivided one-half interest without right of survivorship.\nD. A lien against the entire property.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA defendant had an argument with his neighbor. As they were quarreling, the defendant pulled out his penknife intending only to frighten the neighbor. The defendant accidentally slightly nicked the neighbor's arm with the knife. Unknown to the defendant, his neighbor was a hemophiliac who then died from the cut. What is the most serious crime that the defendant can be convicted of?\nA. Murder.\nB. Voluntary manslaughter.\nC. Involuntary manslaughter.\nD. Battery.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nDefendant is on trial. Which of the following, if occurs, would NOT cause a due process violation in the trial?\nA. The trial is conducted in a way that jurors would not be able to give evidence reasonable consideration.\nB. The defendant is compelled to stand trial in street clothing.\nC. The defendant is compelled to stand trial or appear at penalty phase proceedings visibly shackled (unless there are security concerns).\nD. Jurors are exposed to influence favorable to the prosecution.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nClient has an estate that reads \"To A on condition that if drugs are ever used on premises, B shall have the right to reenter and retake the premises.\" What is NOT true about this kind of estate?\nA. It is a fee simple determinable, and title ends automatically if drugs are used.\nB. It is a fee simple subject to condition subsequent, which requires a reentry first before title can end.\nC. Estate does not revert automatically.\nD. Grantor must exercise right of reentry.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA woman was in a public restroom at a mall. While the woman was at the sink, a man entered the restroom and told her not to make a sound. Frightened, the woman ran to an open window in the bathroom and jumped onto the fire escape. As she exited down the fire escape, the woman accidentally fell, bruising her legs. Which of the following crimes, if any, would the man most likely be convicted of?\nA. Assault.\nB. Battery.\nC. Assault with intent to commit rape.\nD. No crime.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nUnder Article III, federal judicial power extends to which of the following kinds of cases?\nA. interpretation of treaties\nB. interpretation of admiralty laws\nC. disputes between states and foreign citizens\nD. all of the above\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhich of the following is a legislative act that inflicts punishment without a trial?\nA. Bill of attainder\nB. Ex post facto law\nC. Statutes\nD. Ordinances\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nLiang, a talented student from another country, received degrees from several universities in the United States and then decided to stay in the states to teach. Could a state law requiring citizenship for teachers prevent him from doing so?\nA. Yes, because states can regulate aliens.\nB. Yes, because the teacher could exert too much influence.\nC. No, unless they use the rationally related to a legitimate state interest standard.\nD. No, there is no compelling state interest.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIn order to have an irrevocable offer under the Uniform Commercial Code, the offer must\nA. Be made by a merchant to a merchant.\nB. Be contained in a signed writing which gives assurance that the offer will be held open.\nC. State the period of time for which it is irrevocable.\nD. Not be contained in a form supplied by the offeror.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIn transactions between merchants, what is not true about additional terms proposed in the acceptance?\nA. They become part of the contract unless they materially alter the agreement.\nB. Additional terms always become part of the contract.\nC. They become part of the contract unless the offer expressly limits acceptance to the terms of the offer.\nD. They become part of the contract unless the offeror objects within a reasonable time to the additional terms.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA husband is charged with murder in the shooting death of his brother-in-law. In the jurisdiction in which the husband is on trial for murder, the defense of insanity is an affirmative defense. The husband pleads insanity as his defense. At trial, in order to prove his defense of insanity, the husband has\nA. the burden of production.\nB. the burden of persuasion only.\nC. both the burden of production and the burden of persuasion.\nD. neither the burden of production nor the burden of persuasion.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA defendant hated his boss, who had recently demoted him to a less prestigious position. Late one afternoon, the defendant saw his boss walking down the hallway. The defendant pulled out a gun and fired four shots at his boss. Although none of the bullets directly hit his boss, one of the shots ricocheted against a wall and struck the boss in the head, killing him instantly. What is the most serious crime that the defendant can be convicted of?\nA. Murder.\nB. Voluntary manslaughter.\nC. Involuntary manslaughter.\nD. Battery.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIn most states, the division of homicide into degrees is distinguished according to which of the following?\nA. the causal relationship between the defendant's act and the resulting death.\nB. the attendant circumstances surrounding the death.\nC. the nature of the act causing the death.\nD. the defendant's state of mind at the time the killing was committed.\n\nResponse:\n"
    ],
    "obj_label": [
      "D",
      "A",
      "A",
      "B",
      "B",
      "C",
      "B",
      "A",
      "C",
      "B",
      "A",
      "D",
      "D",
      "A",
      "D",
      "B",
      "B",
      "A",
      "A",
      "D"
    ],
    "relation_name": "professional_law"
  },
  "65d5b7c8-4b38-4790-b185-90dfac22118b": {
    "sentences": [
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhat is not true about conversion?\nA. It is an interference with another's right of possession so severe as to warrant defendant to pay full price of chattel.\nB. The intent is to do the act that brings about the interference.\nC. The remedy is recovery of actual damages from harm to chattel or loss of use.\nD. Remedy is damage award of fair market value of chattel.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA man is on trial for securities fraud. He takes the stand to testify in his own behalf. On direct examination, the man's attorney proffers evidence of his good character. Upon objection by the prosecution, which of the following statements is correct?\nA. The defendant may introduce evidence to show truthfulness.\nB. The defendant may introduce evidence to show honesty.\nC. The defendant may not introduce evidence to show honesty because character evidence is inadmissible.\nD. The defendant may not introduce evidence of truthfulness unless it is inquired into on cross- examination.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nUnder the Federal Rules of Evidence, which of the following items of evidence is NOT self- authenticating?\nA. A pamphlet on air safety regulations that a plaintiff claims is an official publication of the Federal Aviation Administration.\nB. A copy of a magazine that a plaintiff claims contains a libelous picture.\nC. A holographic will without attesting signatures that a plaintiff claims was written by her mother in her own handwriting.\nD. A certified copy of his car registration form that, according to a plaintiff, verifies his ownership of the vehicle. \n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nWhen a life tenant fails to protect or preserve their land, permissive waste occurs. What is a life tenant not obligated to do?\nA. Preserve the land and structures in a reasonable state of repair.\nB. Pay interest on mortgages.\nC. Pay ordinary taxes on the land.\nD. Is responsible for damages caused by third-party tortfeasor.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nSuzy, a member of the sandbaggers, is mad about the general state of affairs and is itching to sue the federal government. Which of the following would enable her to have standing to do so?\nA. She has been or will be directly and personally injured by the government action, which affects her rights under the federal law.\nB. A decision in her favor would resolve her grievance.\nC. As a citizen, she can claim that government action violates federal law.\nD. a and b\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIn which situation would a Defendant not be held to the standard of care of a reasonable person?\nA. Defendant is deaf, and is accused of being negligent in failing to heed a warning bell.\nB. Defendant has poor judgment.\nC. Defendant is hot-tempered and damaged property in a tantrum.\nD. Defendant has an I.Q. of 85.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nSally sold heroin to John. John was later stopped by police for speeding. The police searched John's car and found the heroin concealed under the rear seat. Sally is charged with illegally selling heroin. Sally's motion to prevent introduction of the heroin into evidence will most probably be\nA. granted, because the heroin was not in plain view. \nB. granted, because the scope of the search was excessive. \nC. denied, because Sally has no standing to object to the search. \nD. denied, because the search was proper as incident to a valid full custodial arrest. \n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nA breeder of dogs induced a purchaser to buy a puppy by representing that it was a registered basset hound, when in fact the breeder knew it was a mixed breed. The purchaser later discovered that the representation was false. She wants to sue to disaffirm the contract and get a refund. What legal theory would be best applicable to decide this case?\nA. Unconscionability.\nB. Breach of warranty.\nC. Fraudulent inducement.\nD. Fraud in the factum.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIn his will, a jockey devised his home \"to my friend to whom I am everlastingly grateful for the devoted care he has lavished on my horses, but if ever my horses who survive me shall fail to receive proper care, then to my beloved daughter and her heirs, if she be living and own any horses, otherwise to the Equestrian Society. \"In an appropriate action to construe the will, the court will determine the friend's interest to be a\nA. fee simple determinable.\nB. fee simple subject to condition subsequent.\nC. fee simple subject to an executory interest.\nD. contingent remainder.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nClient is claiming self defense in the killing of another. What is not usually true about when deadly force is available?\nA. One must retreat before using deadly force, if it can be done safely, unless the defendant is in his or her home when confronted by an intruder.\nB. One need not attempt to escape before using deadly force.\nC. Deadly force should not be used if it is out of proportion to the amount of force reasonably needed under the circumstances.\nD. Self defense is generally available to the initial aggressor.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nJudge took judicial notice of some facts at the beginning of the trial. Which of the following is not an appropriate kind of fact for judicial notice?\nA. Indisputable facts.\nB. Facts that have been asserted by individual political organizations.\nC. Facts recognized to be true by common knowledge.\nD. Facts capable of scientific verification.\n\nResponse:\n"
    ],
    "obj_label": [
      "C",
      "B",
      "C",
      "D",
      "D",
      "A",
      "C",
      "C",
      "C",
      "D",
      "B"
    ],
    "relation_name": "professional_law"
  }
}