{
  "195d4bd4-3d04-42ff-b31b-dc6e4561a7b7": {
    "sentences": [
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThis question refers to the following information.\n\"Yesterday, December 7, 1941—a date which will live in infamy—the United States of America was suddenly and deliberately attacked by naval and air forces of the Empire of Japan. The United States was at peace with that nation and, at the solicitation of Japan, was still in conversation with its Government and its Emperor looking toward the maintenance of peace in the Pacific. Indeed, one hour after Japanese air squadrons had commenced bombing…the Japanese Ambassador to the United States and his colleague delivered to the Secretary of State a formal reply to a recent American message. While this reply stated that it seemed useless to continue the existing diplomatic negotiations, it contained no threat or hint of war or armed attack….The attack yesterday…has caused severe damage to American naval and military forces. Very many American lives have been lost. In addition American ships have been reported torpedoed on the high seas….As Commander-in-Chief of the Army and Navy, I have directed that all measures be taken for our defense.\"\nPresident Franklin D. Roosevelt, radio address, December 8, 1941\nWhich of the following statements best characterizes the economic consequences of the declaration of war described above?\nA. Japan was subsequently required to pay reparations to the United States, forcing it into a prolonged depression.\nB. The United States economy suffered due to the heavy costs of war.\nC. The United States initiated economic sanctions against Japan, causing a worldwide economic crisis.\nD. The United States was able to pay off its national debt due to the economic benefits of war.\nE. The attack led to an economic boom in Japan.\nF. Decreased trade with Asian nations precipitated economic recession in both the United States and Europe.\nG. The war led to the collapse of the United States economy, forcing it into a prolonged depression.\nH. The war-ravaged condition of Asia and Europe allowed the United States to emerge as one of the most prosperous nations on Earth.\nI. The cost of rebuilding after the attack led to economic recession in the United States.\nJ. Cold War tensions isolated the economies of both the Soviet Union and the United States, leading to economic struggle for both nations.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nIn primates, the location of which of the following determines if it is a quadruped or biped?\nA. the foramen magnum\nB. the skull\nC. the feet\nD. the femur\nE. the spine\nF. the pelvis\nG. the clavicle\nH. the vertebrae\nI. the ulna\nJ. the radius\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThere is evidence that premodern Homo sapiens existed:\nA. 500,000 to 100,000 years ago.\nB. 800,000 to 200,000 years ago.\nC. 200,000 to 50,000 years ago.\nD. 700,000 to 40,000 years ago.\nE. 600,000 to 30,000 years ago.\nF. 100,000 to 10,000 years ago.\nG. 1,000,000 to 500,000 years ago.\nH. 900,000 to 10,000 years ago.\nI. 400,000 to 10,000 years ago.\nJ. 300,000 to 20,000 years ago.\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nThis question refers to the following information.\n\"Buckingham Palace, 10th May 1839.\nThe Queen forgot to ask Lord Melbourne if he thought there would be any harm in her writing to the Duke of Cambridge that she really was fearful of fatiguing herself, if she went out to a party at Gloucester House on Tuesday, an Ancient Concert on Wednesday, and a ball at Northumberland House on Thursday, considering how much she had to do these last four days. If she went to the Ancient Concert on Wednesday, having besides a concert of her own here on Monday, it would be four nights of fatigue, really exhausted as the Queen is.\nBut if Lord Melbourne thinks that as there are only to be English singers at the Ancient Concert, she ought to go, she could go there for one act; but she would much rather, if possible, get out of it, for it is a fatiguing time&….\nAs the negotiations with the Tories are quite at an end, and Lord Melbourne has been here, the Queen hopes Lord Melbourne will not object to dining with her on Sunday?\"\nThe Letters of Queen Victoria, Volume 1 (of 3), 1837-1843: A Selection from Her Majesty's Correspondence Between the Years 1837 and 1861\nA similar fondness for entertainment amongst the nobility was taken to its most outrageous degree in which of the following eras and places?\nA. Nineteenth-century United States\nB. Eighteenth-century Austria\nC. Fifteenth-century England\nD. Sixteenth-century Spain\nE. Nineteenth-century Prussia\nF. Twentieth-century Russia\nG. Eighteenth-century France\nH. Fourteenth-century Italy\nI. Seventeenth-century Ottoman Empire\nJ. Seventeenth-century Netherlands\n\nResponse:\n"
    ],
    "obj_label": [
      "H",
      "A",
      "E",
      "E"
    ],
    "relation_name": "history"
  },
  "1387f292-8312-4ec2-b0e2-8c936874e397": {
    "sentences": [
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nLet (x_n) be a sequence defined by x_1 = 2 and x_{n+1} = 1 + 1/(1 + x_n). If (x_n) converges, what must its limit be in decimals?\nA. 2.718\nB. 1.414\nC. 3.000\nD. 2.235\nE. 3.141\nF. 1.618\nG. 1.732\nH. 0.618\nI. 1.000\nJ. 2.000\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nGiven the following equation: x - e^{-x} = 0. determine the initial approximations for finding the smallest positive root. Use these to find the root correct to three decimal places with Regula-Falsi method.\nA. 0.456\nB. 0.765\nC. 0.850\nD. 0.100\nE. 0.999\nF. 0.567\nG. 0.001\nH. 0.350\nI. 0.654\nJ. 1.234\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nErin made 12 pints of juice. She drinks 3 cups of juice each day. How many days will Erin take to drink all of the juice she made?\nA. 7 days\nB. 2 days\nC. 6 days\nD. 9 days\nE. 16 days\nF. 12 days\nG. 5 days\nH. 8 days\nI. 4 days\nJ. 10 days\n\nResponse:\n",
      "You will be asked a multiple-choice question. Respond with only the letter which corresponds to the correct answer, followed by a period. There is no need to provide an explanation, so your response should be very short.\nNow here is the question:\nSimplify $(5x+3) - 2(2x-4)$.\nA. x+10\nB. x+11\nC. 10x+2\nD. 7+2x\nE. 10+x\nF. 2x+11\nG. x+7\nH. 5x+3\nI. 7x+7\nJ. 3x+7\n\nResponse:\n"
    ],
    "obj_label": [
      "B",
      "F",
      "H",
      "B"
    ],
    "relation_name": "math"
  }
}